Repository: obsidian-level-maker/Obsidian
Catalog: language/*.po
Languages: ru

source: Control the amount of Chaos Devices.
ru: Chaos Device. Управление количеством устройств Хаоса.

source: Dark Servant
ru: Статуэтка слуги

source: Control the amount of Dark Servants.
ru: Dark Servant. Управление количеством статуэток тёмных слуг.

source: Disc of Repulsion
ru: Диск отторжения

source: Control the amount of Discs of Repulsion.
ru: Disc of Repulsion. Управление количеством дисков отторжения.

source: Flechette
ru: Зелье (флешетте)

source: Control the amount of Flechettes.
ru: Flechette. Управление количеством флешетте.

source: Icon of the Defender
ru: Символ Защитника

source: Control the amount of Icons of the Defender.
ru: Icon of the Defender. Управление количеством символов Защитника.

source: Mystic Ambit Incant
ru: Свиток чар единства

source: Control the amount of Mystic Ambit Incants.
ru: Mystic Ambit Incant. Управление количеством свитков с чарами магического единства.

source: Porkalator
ru: Свиноморфер

source: Control the amount of Porkalators.
ru: Porkalator. Управление количеством свиноморферов (хрякинаторов).

source: Torch
ru: Факел

source: Control the amount of Torches.
ru: Torch. Управление количеством факелов.

source: Wings of Wrath
ru: Крылья гнева

source: Control the amount of Wings of Wrath.
ru: Wings of Wrath. Управление количеством крыльев гнева.

source: Ultimate Weapon Pieces
ru: Части Высшего оружия

source: Control the likelihood of finding Ultimate Weapon Pieces.
ru: Ultimate Weapon Pieces. Управление количеством собираемых частей Окончательного (Высшего) оружия.

source: IWAD Style Mode
ru: Имитировать стиль IWAD

source: Attempts to mimic various architectural features seen in the Doom 2 IWAD maps. NOTE: This will override settings in other parts of the program such as Level Size, Room Size, etc!
ru: OBSIDIAN будет пытатсья создавать уровни, подобные тем, что представлены в выбранном IWAD. ПРИМЕЧАНИЕ: Эта опция переопределит абсолютное большинство остальных настроек уровней, монстров и предметов.

source: Jokewad Module
ru: Шуточный модуль

source: FIREBLU Mode
ru: Режим FIREBLU

source: Allows the creation of the greatest maps to ever be generated on the face of the earth. Warning: ticking this waives any liability for potential emotional and physical damage on the part of the user.
ru: Позволяет создавать карты, лучше которых никогда не создавали на Земле в прошлом и, впрочем, не создадут в будущем. Предупреждение о эпилепсии.

source: Pandemic Mode
ru: Режим пандемии

source: Do your part in preventing the coronavirus crisis! Hell is taking away all our tissue rolls and hand sanitizers! It's up to the Slayer to take it back. Every square and every squeeze.
ru: Внесите свой вклад в предотвращение кризиса коронавируса! Ад забирает все наши салфетки и средства дезинфекции! Doomslayer должен забрать их обратно. Каждую протирку. Каждый ещё не использованный кусочек.

source: Megawad Music Swapper
ru: Перемешать музыку по мегаваду

source: Ideal if you have a music WAD replacing all tracks in the game. A note if you are using the ZDoom Specials Shuffle Music option, there is no need to use this module. This is ideal for non-ZDoom ports only.
ru: Перемешать музыку, заменяя все треки в игре. Применима в основном для портов, не основанных на ZDoom: если Вы используете опцию "Перемешать музыку" из дополнений ZDoom, то использовать этот пункт нет особого смысла.

source: FLAT
ru: ПЛОСКИЙ

source: Lower
ru: Низкий

source: Higher
ru: Высокий

source: Pitch-black
ru: Непроглядная мгла

source: Gloomy
ru: Крайне темно

source: Darker
ru: Темнее

source: Brighter
ru: Светлее

source: Vivid
ru: Светло

source: Radiant
ru: Ярчайше

source: Per Theme
ru: По темам

source: Curved
ru: Скруглённые

source: Sharp
ru: Резкие

source: Mostly Short
ru: В основном низкие

source: Slightly Short
ru: Низковатые

source: Slightly Tall
ru: Высоковатые

source: Mostly Tall
ru: В основном высокие

source: Not on Vistas
ru: Не на внеигровые зоны

source: Occasional
ru: Периодически

source: No Damaging
ru: Да

source: 75% of All Levels
ru: 75% от всех уровней

source: 50% of All Levels
ru: 50% от всех уровней

source: 25% of All Levels
ru: 25% от всех уровней

source: 12% of All Levels
ru: 12% от всех уровней

source: Bounded
ru: Ограниченный

source: Strict
ru: Строгий

source: Small-ish
ru: Чаще небольшие

source: Large-ish
ru: Чаще крупные

source: Conservative
ru: Традиционно

source: Very Conservative
ru: Крайне консервативно

source: Less-ish
ru: Чаще меньше

source: More-ish
ru: Чаще больше

source: Advanced Architecture
ru: Расширенные настройки геометрии

source: Oblige v2 Grammar
ru: Правила Oblige v2

source: Sets chance of levels using the Oblige v2 shape grammar.
ru: Устанавливает шанс того, что уровень будет сгенерирован с использованием правил Oblige v2.

source: Gives levels a chance of being generated using the Oblige v2 shape grammar. With this grammar, rooms are always square-shaped, even in parks or caves, with the occasional chunk taken out of one of the corners or sides. Hallways are limited to the dedicated v2 hallway set. Room sizes are very consistent.
ru: Устанавливает шанс того, что уровень будет сгенерирован с использованием правил Oblige v2.x. С ними комнаты всегда имеют прямые углы, в том числе в парках и пещерах; изредка попадается геометрия, срезанная с одного из углов или одной из сторон. Виды коридоров сильно ограничены. Размеры комнат практически не отличаются.

source: Oblige v5 Grammar
ru: Правила Oblige v5

source: Sets chance of levels using the Oblige v5 shape grammar.
ru: Устанавливает шанс того, что уровень будет сгенерирован с использованием правил Oblige v5.

source: Gives levels a chance of being generated using the Oblige v5 shape grammar. With this grammar, indoor rooms are usually square or diamond-shaped. Parks are larger than the indoor areas, but still more or less rectangular in nature. Caves retain their organic layouts. Hallways and joiners are still used as normal. Room sizes are fairly consistent.
ru: Устанавливает шанс того, что уровень будет сгенерирован с использованием правил Oblige v5.x. С ними внутренние помещения обычно квадратные или ромбовидные. Парки крупнее помещений, однако всё равно ещё в целом близки к прямоугольным формам. Пещеры сохраняют свою планировку. Коридоры и соединительные помещения используются наравне с обычными комнатами. Размеры комнат отличаются не очень сильно.

source: Layout Consistency
ru: Шанс согласования форм

source: Chance that a level will be built with a layout from random set of prefered shape rules.
ru: Шанс того, что каждый конкретный уровень будет собран с набором похожих друг на друга форм вместо обычного случайного распределения.

source: Layout consistency attempts to cause levels to overprefer specific shape rules from the ruleset in order to create odd but more consistent combinations of pieces to build the general layout. The effect will be more prominent in certain combinations and levels than others.
ru: Единообразие общего макета геометрии — попытка предпочитать определённый набор правил геометрических форм всем другим. Это приводит к созданию чуть более странного, но и более цельного по структуре уровня. Эффект будет заметен не во всех комбинациях и картах.

source: Linear Mode
ru: Процент линейных карт

source: Creates linear levels, where rooms are connected along a linear layout from start to exit.
ru: Процент создания линейных карт: комнаты последовательно и без развилок соединяются друг с другом от старта до самого выхода (в т. ч. через телепорты).

source: Due to the nature of linear levels, you may encounter teleports even if you have teleports off. This is necessary in order for linear levels not to prematuraly terminate and therefore become stunted i.e. only have 2-5 rooms.
ru: Из-за особенностей линейных карт, Вы можете встретить телепортаторы даже при отключённой соответственной настройке. Это необходимо для того, чтобы линейные уровни не прекращались преждевременно и не имели всего по две-пять комнат.

source: Nature Mode
ru: Процент природных карт

source: Forces most of the map to be composed of naturalistic areas (parks and caves). The ratio is decided by Outdoors style setting while competing styles are ignored.
ru: Заставляет большую часть карты состоять из естественных областей (парки и пещеры). Соотношение определяется настройкой стиля "Пространства под небом"; конфликтующие стили игнорируются.

source: Streets Mode
ru: Процент карт с улицами

source: Allows Oblige to create large street-like outdoor rooms.
ru: Позволяет создавать обширные комнаты, похожие на улицы.

source: Streets-Friendly Themes Only
ru: Для улиц проверяется тема

source: Only allow Streets Mode slider to affect levels with the following themes: Chex Quest 3 - Chextropolis Doom 2 - Urban Heretic - City Strife - Town
ru: Разрешить генерировать улицы из настройки "Процент карт с улицами" только в следующих темах: Doom 2 — Городская тема; Heretic — Город Проклятых (эп. 1); Chex Quest 3 — Chextropolis; Strife (эксп.) — Город.

source: Room Size Multiplier
ru: Множитель размеров комнат

source: Alters the general size and ground coverage of rooms. Vanilla: No room size multipliers. Mix It Up: All multiplier ranges are randomly used with highest and lowest multipliers being rarest.
ru: Изменяет средний размер комнат в целом. Как в оригинале: множитель равен единице, то есть изменения нет. Случайно: все диапазоны множителей используются случайным образом, притом вероятность выбора крайних значений резко снижается (по распределению Гаусса-Лапласа).

source: Area Count Multiplier
ru: Множитель дробности комнат

source: Alters the amount of areas in a room. Influences the amount rooms are divided into different elevations or simply different ceilings if a level has no steepness. Vanilla: No area quantity multipliers. Mix It Up: All multiplier ranges are randomly used with highest and lowest multipliers being rarest.
ru: Изменяет возможное количество различных подлокаций в каждой комнате. Влияет на количество разных по высоте зон. Если уровень не должен иметь перепадов высот полов (должен быть плоским) — то настройка будет влиять только на потолки. Как в оригинале: множитель равен единице, то есть изменения нет. Случайно: все диапазоны множителей используются случайным образом, притом вероятность выбора крайних значений резко снижается (по распределению Гаусса-Лапласа).

source: Size Consistency
ru: Соответствие размеров

source: Changes whether rooms follow a strict single size or not. Can be paired with above choices for more enforced results. Vanilla: Original behavior. Rooms in a level have vary in size from each other. Big Rooms options are respected. Bounded: Rooms vary in size but not radically from each other. Strict: All rooms in the level have a single set size/coverage. Mix It Up: A mixture of 75% Vanilla, 25% Strict.
ru: Насколько строгое ограничение накладывается на размеры комнат на одном уровне; параметры "Тип смешения размера/дробности комнат" также влияют на поведение данной настройки. Как в оригинале: обычное поведение, размеры комнат варьируются во всём диапазоне значений и практически не зависят друг от друга. Часто встречаются обширные локации. Ограниченный: размеры комнат различаются, но не радикально. Строгий: все комнаты на уровне имеют одинаковый размер. Случайно: приблизительно 75% от "Как в оригинале", 25% от "Строго".

source: Room Size Mix Fine Tune
ru: Уклон случайных размеров комнат

source: Alters the behavior of Mix It Up for Room Size Multiplier options. Normal: Mix it up uses a normal curve distribution. Traditional-sized rooms are common and smaller or larger sizes are slightly less so. Small-ish: Only smaller room sizes, but biased towards normal sizes. Small: Biased towards smaller room sizes with no larger room sizes. Large: Biased towards large rooms sizes with no smaller room sizes.. Large-ish: Only larger room sizes, but biased towards normal sizes. Conservative: Probability is biased more towards regular room sizes, making much smaller or much larger rooms significantly rarer. Very Conservative: Bias is even stronger towards regular and smaller rooms sizes, while larger rooms are very rare. Random: No curve distribution - room sizes and room area counts are picked completely randomly.
ru: Изменяет поведение варианта "Случайно" настройки "Множитель размеров комнат". Нормально: обычное распределение Гаусса-Лапласа. Наиболее часто встречаются комнаты среднего размера, вероятность выбора крайних значений резко снижается. Чаще небольшие: в основном небольшие комнаты, но с уклоном в сторону нормальных размеров. Меньше: сильный уклон в сторону малых комнат, обширных за всю игру можно и не встретить. Больше: сильный уклон в сторону обширных комнат, малых, можно считать, нет. Чаще крупные: в основном обширные комнаты, но с уклоном в сторону нормальных размеров. Традиционно: вероятность больше смещена в сторону обычных размеров, что значительно понижает шанс появления комнат, отличных от средних. Крайне консервативно: вероятность смещена в сторону обычных и меньших размеров комнат, обширные встречаются неимоверно редко. Случайно: никакое распределение не учитывается, размеры комнат выбираются абсолютно случайным образом.

source: Room Area Mix Fine Tune
ru: Уклон случайной дробности комнат

source: Alters the behavior of Mix It Up for Room Area Multiplier options. Normal: Mix it up uses a normal curve distribution. Less-ish: Only rooms with less floors and simple ceilings, but biased towards normal counts. Less: Biased towards rooms with less floors and simple ceilings. More: Biased towards rooms with more floors and complex ceilings. More-ish: Only rooms with more floors and complex ceilings, but biased towards normal counts. Conservative: Biased towards normal area counts. Very Conservative: Further biased towards normal area counts. Random: No curve distribution - room area counts are picked completely randomly.
ru: Изменяет поведение варианта "Случайно" настройки "Множитель дробности комнат". Нормально: обычное распределение Гаусса-Лапласа. Наиболее часто выбирается среднее значение количества зон, вероятность очень большого или очень малого количества резко снижается. Чаше меньше: в основном комнаты с небольшой дробностью, но с уклоном в сторону обычного количества зон. Меньше: сильный уклон в сторону малого разбиения, практически изотропные комнаты. Больше: комнаты разбиваются на зоны практически всегда. Чаще больше: в основном комнаты с сильным делением, но с уклоном в сторону нормального количества подлокаций. Традиционно: вероятность смещена в сторону обычного количества зон. Крайне консервативно: вероятность сильно смещена в сторону обычного количества зон, иные виды разбиения встречаются крайне редко. Случайно: никакое распределение не учитывается, количество подлокаций для комнат выбирается абсолютно случайным образом.

source: Big Rooms
ru: Обширные комнаты

source: Raises upper limits on individual room growth
ru: Повышает шанс того, что каждая конкретная комнаты будет увеличена в размерах.

source: Big Outdoors
ru: Обширные пространства под небом

source: Raises upper limits on outdoor area growth
ru: Повышает предел размеров каждой конкретной области под открытым небом.

source: Room Heights
ru: Высоты комнат

source: Determines if rooms should have a height limit or should exaggerate their height. Short means room areas strictly have at most 128 units of height, tall means rooms immediately have doubled heights. Normal is the default Oblige behavior.
ru: Определяет, насколько высокими будут комнаты. Варианты "Низкие" будет ограничивать максимальную высоту комнат до 128 маппикселей, "Высокие" — удваивать высоты.

source: Parks
ru: Парки

source: Control the amount of parks.
ru: Управляет количеством парков на уровне.

source: Natural Cliffs
ru: Природные утёсы

source: Percentage of parks that use completely naturalistic walls.
ru: Процент парков, использующий полностью природные стены.

source: Park Detail
ru: Детализация парков

source: Auto Detailing
ru: Автоподгонка кол-ва деталей

source: Reduces or increases the probability of park decorations such as trees on park rooms.
ru: Изменяет шанс появления декораций в парках, таких, например, как деревья.

source: Windows
ru: Окна

source: Control the amount of windows.
ru: Управляет количеством окон на уровне.

source: Passable Windows
ru: Проходимые окна

source: Sets the preferences for passability on certain windows. On Vistas Only means only windows that look out to vistas/map border scenics have a blocking line.
ru: Устанавливает возможность прохождения сквозь окна. "Не на внеигровые зоны" означает, что блок-линии будут присутствовать исключительно на тех окнах, которые выходят непосредственно на внеигровые декорации.

source: Passable Railings
ru: Проходимые (3D) перила

source: Sets the passability of railing junctions between full impassability or the 3D midtex flag. Occasional means 3D midtex is only used on railings between areas the player is supposed to circumvent. Always means the inclusion of cages and scenic rails, allowing flying monsters to potentially escape. Note: 3D midtex lines currently *block* projectiles as well.
ru: Устанавливает перилам флаг "3D-midtex" (вместо полной непроходимости). Иногда это означает, что указанный флаг будет использоваться только на перилах между обязательными для посещения областями. Заборы, выходящие во внеигровые зоны, а также клетки непроходимы всегда, что не позволяет летающим монстрам уйти с предназначенных им позиций. Примечание: 3D-линии в настоящее время также *блокируют* снаряды.

source: Symmetry
ru: Симметрия

source: Affects amount of symmetry when growing levels.
ru: Влияет на количество симметричных деталей при увеличении уровней.

source: Beams
ru: Вертикальные балки

source: Allows the appearance of thin pillars to appear between the borders of different elevations.
ru: Позволяет OBSIDIAN использовать тонкие колонны для "поддержки" потолков на границах разных высот.

source: Fences
ru: Заборы

source: Creates thick solid fences and fence posts between areas of varying height for outdoor rooms.
ru: Создание толстых непроходимых заборов и им подобных ограждений между участками под небом.

source: Porches\Gazebos
ru: Террасы и беседки

source: Occasional outdoor areas with a lowered indoor-ish ceiling.
ru: Периодические локации под открытым небом с пониженным потолком (как в помещениях).

source: Pictures
ru: Картины и панно

source: Controls the large wall setpieces in a map. Works on a chance per room basis.
ru: Управляет большими стенами на карте. Метод вычисления — шанс на комнату.

source: Scenics
ru: Красивые виды вне карты

source: Controls the amount of fancy scenics visible at room bordering the maps.
ru: Управляет количеством красивых пейзажей во внеигровой зоне.

source: Sink Style
ru: Очертания акваторий

source: Determines the style for corners with sunken ceilings and floors. Curved makes sink corners soft, while Sharp leaves the corners angular. Per Theme means choice is controlled by theme profile instead. Tech-ish maps favor sharp corners while hell-ish favor curved.
ru: Определяет вид углов акваторий. Вариант "По темам" означает, что выбор зависит от текущей темы: в картах с уклоном в технический стиль предпочитаются острые углы, в адских уровнях — скруглённые.

source: Liquid Sinks
ru: Акватории

source: Enables or disables liquid sinks. Liquid sinks are walkable floors that are often converted into depressions with the level's liquid. May greatly inconvenience the player but default Oblige behavior is 'Yes'.
ru: Управляет появлением луж, стоков, шлюзов и других небольших углублённых локаций с жидкостью, наиболее широко используемой на текущем уровне. Может доставлять много неудобств игроку, однако в Oblige по умолчанию стоит "Да" (создавать).

source: Dark Outdoors
ru: Тёмное пространство под небом

source: Affects the chance of a level having darker skies.
ru: Влияет на интенсивность естественного света на открытых областях.

source: Outdoor Shadows
ru: Тени геометрии под небом

source: Adds shadows to outdoor structures.
ru: Добавлять тени для структур, расположенных на открытых пространствах.

source: Minimum Brightness
ru: Минимальная яркость

source: Sets the minimum brightness for the map.
ru: Устанавливает нижний предел яркости для всех карт.

source: Maximum Brightness
ru: Максимальная яркость

source: Sets the maximum brightness for the map.
ru: Устанавливает верхний предел яркости для всех карт.

source: Explosive Decor
ru: Взрывные декорации

source: Controls the presence of barrels, pods, canisters, etc.
ru: Контролирует наличие бочек с радиоактивными отходами (Doom), взрывных коконов (Heretic), канистр и т. д.

source: Doors
ru: Двери

source: Control the amount of doors.
ru: Управляет общим количеством дверей.

source: Keyed Doors
ru: Двери, запертые на ключ

source: Control the amount of keyed doors.
ru: Управляет количеством дверей, запертых на ключ.

source: Triple-Keyed Doors
ru: Двери, запертые на три ключа

source: Controls the chance to get three key door whenever three keys are present.
ru: Управляет шансом появления двери, запертой на все три ключа, если те есть на уровне.

source: Switch Goals
ru: Двери, управляемые переключателями

source: Controls the chance for long-distance switch and lock quests.
ru: Управление шансом появления далеко расположенных переключателей.

source: Switch Rooms
ru: Шанс локальных переключателей

source: Controls the chance same-room switches and locks.
ru: Шанс того, что переключатель появится в комнате с целевым объектом (например, дверью).

source: Road Markings
ru: Дорожная разметка

source: Adds street markings to roads.
ru: Добавляет дорожную разметку на улицы.

source: Street Traffic
ru: Уличное движение

source: If Street Mode is enabled, changes the density of prefabs such as cars, barriers, crates, and relevant items on the roads.
ru: Если "Процент карт с улицами" отличен от нуля, изменяет шанс появления префабов, связанных с ними: автомобили, барьеры, ящики и другие подобные встречающиеся на дорогах объекты.

source: Exit Signs
ru: Таблички "Выход"

source: Places exit signs by exiting room
ru: Добавляет информационные таблички с указанной надписью в соответственных комнатах.

source: Linear Start
ru: Линейные старты

source: Stops start rooms from having more than one external room connection. Can help reduce being overwhelmed by attacks from multiple directions when multiple neighboring rooms connect into the start room. Default means no control, and levels can have linear starts at random based on shape grammars as per original Oblige 7.7 behavior.
ru: Не позволяет генератору создавать стартовые комнаты с более чем одним проходом в соседние локации, что может уменьшить в начале уровня количество атак с разных направлений. "По умолчанию" означает отсутствие подобных проверок, однако уровни всё равно могут случайно сгенерироваться с линейным началом — в соответствии с исходным поведением Oblige 7.7.

source: Dead Ends
ru: Тупики

source: Cleans up and removes areas with staircases that lead to nowhere. NONE means all dead ends are removed. Heaps means all dead ends are preserved (Oblige default).
ru: Уменьшает количество тупиков, а также лестниц, ведущих в никуда. Нет: все тупики будут убраны. Множество: не уменьшать количество тупиков (обычное поведение Oblige).

source: Lighting
ru: Освещение

source: Detail
ru: Детализация

source: Multiple Paths
ru: Разветвление путей

source: 3D Floors
ru: 3D-полы

source: Lakes
ru: Озёра

source: Modded Game Extras
ru: Для известных модификаций

source: Offers extra features and expanded support for various mods.
ru: Встраивает в уровни дополнительные возможности, подходящие к различным известным модификациям.

source: HN Markers
ru: Метки Hellscape Navigator
