Repository: obsidian-level-maker/Obsidian
Catalog: language/*.po
Languages: ru

source: Chance per map of marine closets spawning at all. E.G. at 50% theres 50% chance of each map being empty of marine closets.
ru: Шанс того, что на карте вообще появится комната с дружественными морпехами. К примеру, шанс в 50% означает, что такие помещения будут существовать на половине ото всех уровней.

source: Minimum closets
ru: Мин. комнат с морпехами

source: Sets least amount of closets that can spawn per map.
ru: Устанавливает минимальный предел количества комнат с морпехами на карту.

source: Maximum closets
ru: Макс. комнат с морпехами

source: Sets most amount of closets that can spawn per map.
ru: Устанавливает максимальный предел количества комнат с морпехами на карту.

source: Closet scaling type
ru: Изменение количества по уровням

source: Affects how min and max work for closet count: Random: Random range Progressive: Goes from min to max through entire game Episodic: Goes from min to max through episode Regressive/Regressive episodic: Goes from max to min through game or episode
ru: Определяет, каким образом учитываются опции "Макс. комнат и морпехами" и "Мин. комнат с морпехами". Случайно: значение выбирается случайным образом между минимумом и максимумом. Постепенно: количество комнат постепенно нарастает на протяжении всей игры. По эпизодами: количество комнат постепенно нарастает, от минимума в первом эпизоде до максимума в последнем. Регрессивно [по эпизодам]: количество комнат постепенно уменьшается, от максимума в первом уровне/[эпизоде] до минимума в последнем.

source: Minimum marines
ru: Минимум морпехов

source: Sets least amount of marines that can spawn per closet.
ru: Нижний предел количества морпехов на каждую комнату.

source: Maximum marines
ru: Максимум морпехов

source: Sets most amount of marines that can spawn per closet.
ru: Верхний предел количества морпехов на каждую комнату.

source: Marine Health
ru: Здоровье морпехов

source: Influences how much damage marines can take before dying.
ru: Насколько много урона могут принять на себя морпехи прежде чем умрут. По умолчанию — 100.

source: Marine scaling type
ru: Изменение числа морпехов по уровням

source: Affects how min and max work for marine count: Random: Random range Progressive: Goes from min to max through entire game Episodic: Goes from min to max through episode Regressive/Regressive episodic: Goes from max to min through game or episode
ru: Определяет, каким образом учитываются опции "Максимум морпехов" и "Минимум морпехов". Случайно: значение выбирается случайным образом между минимумом и максимумом. Постепенно: количество нарастает от минимума до максимума на протяжении всей игры. По эпизодами: количество морпехов постепенно нарастает, от минимума в первом эпизоде до максимума в последнем. Регрессивно [по эпизодам]: количество морпехов постепенно уменьшается, от максимума в первом уровне/[эпизоде] до минимума в последнем.

source: Level Min Position
ru: Близость к старту

source: Affects how early in the level a closet can be found.
ru: Определяет, насколько скоро относительно первой (стартовой) локации могут начинать генерироваться комнаты с морпехами.

source: 0:0 (Start Room),1:1 (Exit Room)
ru: 0:0 (Начальная комната),1:1 (Комната выхода)

source: Level Max Position
ru: Удалённость от старта

source: Affects how late in the level a closet can be found.
ru: Определяет, после какого процента уровня относительно первой (стартовой) локации комнаты с морпехами уже не могут быть сгенерированы.

source: Weapon tech level
ru: Технический уровень оружия

source: Influences weapons that marines spawn with: Very Low tech: Clearing demonic invasion with nothing but pistols and harsh language Low tech: Pistols, with some rare chainguns and shotguns Mid tech: Shotguns/Chainguns with some rare pistols, super shotguns, rocket launchers and plasma rifles High tech: Rocket launchers/Plasma rifles with some rare BFGs, super shotguns and chainguns Mix it up: Any weapon goes, let the dice decide! BFG Fiesta: BFG only, cyberdemons beware! Progressive: Marines start with pistols and get more powerful weapons through episode/megawad
ru: Определяет, каким оружием будут владеть дружественные морпехи. Почти нулевой: зачистка вторжения демонов исключительно с помощью верного пистолета и крепкого словца. Низкий: в основном пистолеты, но уже попадаются и дробовики, и пулемёты. Средний: предпочтение отдаётся дробовикам и пулемётам с редким вкраплением двустволок, ракетниц и плазменных винтовок. Кто-то, однако, всё равно будет предпочитать пистолеты. Высокий: ракетницы и плазменные винтовки, реже — двустволки, пулемёты и BFG9000. Случайно: против демонов всё подходит, так что пусть решит судьба... Постепенно: морпехи, начиная с пистолетов, повышают свой уровень оружия по ходу игры. BFG-вечеринка: кибердемоны... Бойтесь!

source: Trigger Type
ru: Тип активации

source: Influences the trigger that activates marines. Sight: Marine closet activates once it can 'see' the player. Range: Closet activates when player is close enough, even if behind wall. Close Range: same as range except requires player to be really really close. Map Start: Closets are active on map start.
ru: Определяет момент активации комнаты морпехов. Игрок в зоне видимости: только когда кто-то из её квартирантов может "увидеть" игрока. Игрок рядом: если игрок подошёл на достаточно близкое расстояние к ней. Игрок совсем близко: то же, что и "Игрок рядом", но здесь для активации он должен подойти буквально вплотную. Со старта карты: все комнаты с морпехами активны с самого начала уровня.

source: Marine Color
ru: Цвет морпехов

source: Lets you choose the color of marines, including option for random color per marine.
ru: Позволяет выбрать цвет брони морпехов, в том числе и случайную окраску на каждого.

source: Friendly Fire
ru: Огонь по своим

source: By default marines do no damage to player. However that means their use their own version of puffs and projectiles. If this is enabled marines can damage player and original puffs and projectiles are used making them affected by mods that replace those. Additionally if self damage variant is chosen marines can still get hurt by exploding barrels and such
ru: По умолчанию морпехи не наносят урон игроку; это вытекает из того, что они используют собственные, новые вариации хитскан-оружия и снарядов. При включённой настройке морпехи будут использовать обычные снаряды и хитскан-атаки из Doom, что позволяет использовать их в заменяющих их модификациях. Также, если выбран вариант с уроном по себе, морпехи смогут получать урон от взрывающихся бочек и тому подобных вещей.

source: Player Damage Immunity
ru: Иммунитет к урону от игрока

source: If enabled, marines will never take damage from player owned sources.
ru: Если включено, дружественные морпехи никогда не будут получать урон от игрока.

source: Weapon Sprites
ru: Спрайты оружия

source: By default marines use default player sprite. If this is enabled, marines will use special sprites according to weapon they carry. With merge option sprites will be merged into oblige wad, otherwise they need to be loaded separately.
ru: По умолчанию морпехи используют обычные спрайты игрока. Эта настройка позволяет изменить их внешний вид в соответствии с оружием, которое они носят. Если выбран пункт с объединением, то спрайты будут вшиты в выходной *.WAD-файл, в противом случае их нужно будет подгружать отдельно.

source: Monster Quantity Multiplier
ru: Множитель количества монстров

source: Influences amount of monsters in rooms with a marine closet.
ru: Влияет на количество монстров в комнатах с морпехами.

source: Monster Strength Modifier
ru: Множитель силы монстров

source: If set, this strength setting is used in the room with marine closet instead of normal one.
ru: Если этот параметр силы установлен, то он будет использоваться в комнате с морпехами вместо обычного.

source: Strong Marines
ru: Сверхвысокая реакция морпехов

source: Influences whether marines are as accurate and rapid firing as player, or are weaker.
ru: Влияет на то, стреляют ли пехотинцы так же точно и быстро, как игрок, или же они будут несколько слабее.

source: Followers
ru: Следуют за игроком

source: By default marines try to follow the player if they have nothing else to do but would otherwise prioritize chasing enemies, and are also unable to follow player through rough terrain. If this is enabled marines will much harder prioritize following player and will teleport if they are too far away.
ru: По умолчанию морпехи, если у них нет цели, пытаются следовать за игроком. Если эта функция включена, то на функцию следования за игроком у них будет выставлен минимальный приоритет. Однако же они будут телепортироваться к Вам, если окажутся слишком далеко.

source: Follow Distance
ru: Лимит расстояния следования

source: If marines are followers, the maximum allowed distance they are allowed to stray before being teleported to the player.
ru: Максимально разрешённая дистанция, после которой морпехи будут телепортироваться к игроку вместо того, чтобы пытаться к нему подойти.

source: Allow in Gotchas
ru: Также на специальных картах

source: Allows or disallows marine closets to spawn on gotchas and boss generator levels.
ru: Разрешает появляться комнатам с морпехами в предсделанных уровнях и картах с босс-аренами.

source: Death Messages
ru: Сообщения о смерти

source: If enabled, will print a message in message log whenever a marine dies.
ru: Если опция включена, то в консоль будут выводиться сообщения о смерти дружественных морпехов.

source: In Secret Rooms
ru: Также создавать в секретках

source: If enabled, allowed marine closets to be built in secret rooms.
ru: При включённой опции комнаты с морпехами будут генерироваться также и в секретных комнатах.

source: Heretic Monster Control
ru: Настройка монстров Heretic

source: Gargoyle
ru: Горгулья

source: Control the amount of Gargoyles.
ru: Gargoyle. Управление количеством горгулий.

source: Fire Gargoyle
ru: Огненная горгулья

source: Control the amount of Fire Gargoyles.
ru: Fire Gargoyle. Управление количеством огненных горгулий.

source: Warrior
ru: Воин

source: Control the amount of Warriors.
ru: Warrior. Управление количеством воинов.

source: Warrior Ghost
ru: Призрачный воин

source: Control the amount of Warrior Ghosts.
ru: Warrior Ghost. Управление количеством призрачных воинов.

source: Golem
ru: Голем

source: Control the amount of Golems.
ru: Golem. Управление количеством големов.

source: Golem Ghost
ru: Призрачный голем

source: Control the amount of Golem Ghosts.
ru: Golem Ghost. Управление количеством призрачных големов.

source: Nitro
ru: Нитроголем

source: Control the amount of Nitrogolems.
ru: Nitrogolem. Управление количеством нитроголемов.

source: Nitro Ghost
ru: Призрачный нитроголем

source: Control the amount of Nitrogolem Ghosts.
ru: Nitro Ghost. Управление количеством призрачных нитроголемов.

source: Disciple
ru: Адепт Д'Спарила

source: Control the amount of Disciples.
ru: Disciple of D'Sparil. Управление количеством магов-адептов Д'Спарила.

source: Sabreclaw
ru: Саблекоготь

source: Control the amount of Sabreclaws.
ru: Sabreclaw. Управление количеством саблекогтей.

source: Weredragon
ru: Оборотень

source: Control the amount of Weredragons.
ru: Weredragon. Управление количеством оборотней.

source: Ophidian
ru: Змееподобный

source: Control the amount of Ophidians.
ru: Ophidian. Управление количеством человекозмеев.

source: Ironlich
ru: Железный Лич

source: Control the amount of Ironliches.
ru: Ironlich. Управление количеством железных Личей.

source: Maulotaur
ru: Малотавр

source: Control the amount of Maulotaurs.
ru: Maulotaur. Управление количеством малотавров.

source: D'Sparil
ru: Д'Спарил

source: Control the amount of D'Sparils.
ru: D'Sparil. Управление количеством Д'Спарилов.

source: Heretic Weapon Control
ru: Настройка оружия Heretic

source: Gauntlets
ru: Перчатки Некроманта

source: Control the likelihood of finding the Gauntlets of the Necromancer.
ru: Gauntlets. Управление количеством перчаток Некроманта.

source: Crossbow
ru: Арбалет

source: Control the amount of Crossbows.
ru: Crossbow. Управление количеством эфирных арбалетов.

source: Dragon Claw
ru: Коготь

source: Control the amount of Dragon Claws.
ru: Dragon Claw. Управление количеством драконьих когтей.

source: Hellstaff
ru: Адский посох

source: Control the amount of Hellstaves.
ru: Hellstaff. Управление количеством адских посохов.

source: Phoenix Rod
ru: Жезл Феникса

source: Control the amount of Phoenix Rods.
ru: Phoenix Rod. Управление количеством жезлов Феникса.

source: Fire Mace
ru: Огненная булава

source: Control the amount of Fire Maces.
ru: Fire Mace. Управление количеством огненных булав.

source: Default
ru: По умолчанию

source: Night
ru: Ночь

source: Day
ru: День

source: Never
ru: Никогда

source: Always
ru: Всегда

source: Hills
ru: Холмы

source: Mountainous
ru: Горы

source: Cavernous
ru: Пещеры

source: DEFAULT
ru: ПО УМОЛЧАНИЮ

source: Blue + White Clouds
ru: Синий + белые облака

source: Dark Grey
ru: Тёмно-серый

source: Red-ish
ru: Красноватый

source: Brown-ish
ru: Коричневатый

source: Jade
ru: Нефритовый, желтовато-зелёный

source: Peach
ru: Пляжный

source: Rainbow
ru: Радужный

source: Black
ru: Чёрный

source: Tan
ru: Рыжевато-коричневый

source: Dark Green
ru: Тёмно-зелёный

source: Dark Brown
ru: Тёмно-коричневый

source: Green-ish
ru: Зеленоватый

source: Ice
ru: Ледяной

source: Sky Generator
ru: Создание неба

source: Time of Day
ru: Время дня

source: This forces the sky background (behind the hills and clouds) to either be night or day. Default means vanilla Oblige behavior of picking one episode to be night. Random means 50% chance of night or day to be picked per episode.
ru: Меняет фон неба (за рельефом и облаками) на ночное или дневное. "По умолчанию" означает, что лишь один эпизод будет ночным. "Случайно" — равная вероятность выбора ночного или дневного неба для каждого эпизода.

source: Terrain Foreground
ru: Ближний план

source: Influences whether the sky generator should generate terrain in the skybox.
ru: Влияет на то, должен ли генератор неба добавлять ландшафт непосредственно в текстуру скайбокса.

source: Terrain Parameters
ru: Параметры ближнего плана

source: Changes the parameters of generated hills, if there are any. 'Cavernous' causes the terrain to nearly fill up most of the sky, making an impression of being inside a cave or crater.
ru: Изменяет параметры генерируемого рельефа, если он есть. Вариант "Пещеры" заполняет рельефом большую часть скайбокса, создавая впечатление, что вы находитесь внутри ущелья или кратера.

source: Day Sky Color
ru: Цвет дневного неба

source: Picks the color of the sky if day. Default means random and theme-ish.
ru: Влияет на цвет дневного неба. "По умолчанию" — случайно, но с учётом темы уровня.

source: Terrain Color
ru: Цвет ближнего плана

source: Picks the color of the terrain in the sky if available. Default means random and theme-ish.
ru: Влияет на цвет ландшафта, если таковой существует. "По умолчанию" — случайно, но с учётом темы уровня.

source: Nebula Color
ru: Цвет туманности

source: Picks the color of nebula if sky is night. 'None' means just a plain starry night sky. Default means random and theme-ish.
ru: Влияет на цвет туманности на ночном небе. При выборе "Нет" будет сгенерирован простой звёздный купол небосвода. "По умолчанию" — случайно, но с учётом темы уровня.

source: Sky Gen Lighting
ru: Освещение мест под небом

source: Overrides (and ignores) Dark Outdoors setting in Miscellaneous tab. If the sky generator creates night skies for an episode, episode's map outdoors is also dark but bright if day-ish.
ru: Переопределяет и, как следствие, игнорирует настройку "Тёмные пространства под небом". Если генератор неба создал ночные виды, то всё пространство под ним будет затемнённым, и наоборот — для дневного времени суток локации под небом будут ярко освещёнными.

source: Per Sky Generator
ru: Учитывать цвет неба

source: All
ru: Все

source: Outdoors Only
ru: Только под небом

source: Subtle
ru: Трудноразличимый

source: Misty
ru: Неясный

source: Smoky
ru: Дымчатый

source: Foggy
ru: Туманный

source: Dense
ru: Плотный

source: Generic
ru: Универсальный

source: Generated
ru: Случайно сгенерированный

source: Universal Intermission
ru: Всегда одна и та же

source: ZDoom Special Addons
ru: Спец. дополнения ZDoom

source: This module adds new ZDoom-exclusive features such as fog. More ZDoom-specific features will be included soon.
ru: Этот модуль добавляет некоторые функции, эксклюзивные для ZDoom — к примеру, туман. Больше специальных возможностей ZDoom будет включено позже.

source: Fog Generator
ru: Генератор тумана

source: Generates fog colors based on the Sky Generator or generate completely randomly.
ru: Если создавать туман — то определять ли его цвет на основе сгенерированного неба или же не зависеть от него и, как следствие, выбирать окрас случайным образом.

source: Fog Environment
ru: Локации с туманом

source: Limits fog to outdoors (sectors with exposed sky ceilings) or allows for all.
ru: Ограничить распространение тумана только локациями под небом или же разрешить его для всех секторов.

source: Fog Intensity
ru: Плотность тумана

source: Determines thickness and intensity of fog, if the Fog Generator is enabled. Subtle or Misty is recommended.
ru: Определяет плотность тумана, если он включён. Для большинства целей рекомендуется использовать слабые варианты — к примеру, "Трудноразличимый" или "Неясный".

source: Sky Fog
ru: Туман в небе

source: Tints the sky texture with the fog color, intensity is based on the Fog Intensity selection.
ru: Подстраивает цвет текстуры неба под цвет тумана. Сила заливки основана настройке плотности тумана.

source: Dynamic Lights
ru: Динамический свет

source: Generates dynamic point lights on ceiling light prefabs.
ru: Генерирует динамический свет на префабах потолочного освещения.

source: Glowing Flats
ru: Мерцающие поверхности

source: Adds Doom-64 style lighting/glowing flats via GLDEFS lump. Visible on Zandronum ports as well.
ru: Добавляет освещение и мерцающие поверхности в стиле Doom-64 с помощью lump GLDEFS. Zandronum также поддерживает эту функцию.

source: Shuffle Music
ru: Перемешать музыку

source: Shuffles music in the MAPINFO lump.
ru: Перемешать музыку в lump MAPINFO.

source: Story Generator
ru: Новый текст повествования

source: Adds cluster information with generic or randomized story text into the MAPINFO structure!
ru: Добавляет новые истории в MAPINFO на экраны межмиссионных текстов на основе универсальной (общей) или же случайной структуры.

source: Quit Messages
ru: Изменить сообщения выхода

source: Adds custom quit messages into the MAPINFO game definition.
ru: Изменяет в MAPINFO сообщения при выходе из игры на новые.

source: Intermission Music
ru: Музыка на интермиссиях

source: Changes the music playing during intermission screens.
ru: Изменяет музыку, играющую на интермиссионных экранах.

source: Disable Intermissions
ru: Убрать интермиссионные экраны

source: Removes end-level Intermission Screens (containing map completion data) but retains Text Screens with story.
ru: Удаляет все интермиссионные экраны, содержащие статистику по пройденному уровню. Текстовые вставки (истории) остаются.

source: Hexen Monster Control
ru: Настройка монстров Hexen

source: Ettin
ru: Эттин

source: Control the amount of Ettins.
ru: Ettin. Управление количеством эттинов.

source: Afrit
ru: Африт

source: Control the amount of Afrits.
ru: Afrit. Управление количеством афритов.

source: Centaur
ru: Кентавр

source: Control the amount of Centaurs.
ru: Centaur. Управление количеством кентавров.

source: Slaughtaur
ru: Старший кентавр

source: Control the amount of Slaughtaurs.
ru: Slaughtaur. Управление количеством Старших кентавров (кентавров-убийц).

source: Stalker
ru: Сталкер

source: Control the amount of Stalkers.
ru: Stalker. Управление количеством сталкеров.

source: Stalker w/ projectile
ru: Дальнобойный сталкер

source: Control the amount of Projectile Stalkers.
ru: Stalker with projectile. Управление количеством дальнобойных сталкеров.

source: Wendigo
ru: Вендиго

source: Control the amount of Wendigos.
ru: Wendigo. Управление количеством Вендиго.

source: Green Serpent
ru: Зелёный змей Хаоса

source: Control the amount of Green Serpents.
ru: Green Serpent. Управление количеством зелёных змеев Хаоса.

source: Brown Serpent
ru: Бурый змей Хаоса

source: Control the amount of Brown Serpents.
ru: Brown Serpent. Управление количеством бурых змеев Хаоса.

source: Bishop
ru: Епископ

source: Control the amount of Bishops.
ru: Bishop. Управление количеством епископов.

source: Reiver
ru: Дух-разбойник

source: Control the amount of Reivers.
ru: Reiver. Управление количеством духов (грабителей).

source: Buried Reiver
ru: Похороненный дух

source: Control the amount of Buried Reivers.
ru: Buried Reiver. Управление количеством похороненных духов (грабителей).

source: Heresiarch
ru: Ересиарх

source: Control the amount of Heresiarchs.
ru: Heresiarch. Управление количеством Ересиархов.

source: Zedek
ru: Цедек

source: Control the amount of Zedeks.
ru: Zedek. Управление количеством Цедеков, воинов-ренегатов.

source: Traductus
ru: Традуктус

source: Control the amount of Traducti.
ru: Traductus. Управление количеством Традуктусов, клериков-ренегатов.

source: Menelkir
ru: Менелкир

source: Control the amount of Menelkirs.
ru: Menelkir. Управление количеством Менелкиров, магов-ренегатов.

source: Korax
ru: Коракс

source: Control the amount of Koraxes.
ru: Korax. Управление количеством Кораксов, Средних Змеиных Всадников.

source: Hexen Item Control
ru: Настройка предметов Hexen

source: Crystal Vial
ru: Кристальный флакон

source: Control the amount of Crystal Vials.
ru: Crystal Vial. Управление количеством кристальных флаконов.

source: Quartz Flask
ru: Кварцевый флакон

source: Control the amount of Quartz Flasks.
ru: Quartz Flask. Управление количеством кварцевых флаконов.

source: Mystic Urn
ru: Мистическая урна

source: Control the amount of Mystic Urns.
ru: Mystic Urn. Управление количеством мистических урн.

source: Blue Mana
ru: Синяя мана

source: Control the amount of Blue Mana.
ru: Blue Mana. Управление количеством синей маны.

source: Green Mana
ru: Зелёная мана

source: Control the amount of Green Mana.
ru: Green Mana. Управление количеством зелёной маны.

source: Dual Mana
ru: Комбинированная мана

source: Control the amount of Dual Mana.
ru: Combined (dual) Mana. Управление количеством комбинированной маны.

source: Platinum Helm
ru: Платиновый шлем

source: Control the amount of Platinum Helms.
ru: Platinum Helm. Управление количеством платиновых шлемов.

source: Mesh Armor
ru: Кольчуга

source: Control the amount of Mesh Armors.
ru: Mesh Armor. Управление количеством кольчуг.

source: Falcon Shield
ru: Щит сокола

source: Control the amount of Falcon Shields.
ru: Falcon Shield. Управление количеством щитов сокола.

source: Amulet of Warding
ru: Амулет стража

source: Control the amount of Amulets of Warding.
ru: Amulet of Warding. Управление количеством амулетов стража.

source: Dragonskin Bracers
ru: Наручи из драконьей кожи

source: Control the amount of Dragonskin Bracers.
ru: Dragonskin Bracers. Управление количеством наручей из драконьей кожи.

source: Krater of Might
ru: Чаша могущества

source: Control the amount of Kraters of Might.
ru: Krater of Might. Управление количеством чаш могущества.

source: Banishment Device
ru: Эмблема изгнания

source: Control the amount of Banishment Devices.
ru: Banishment Device. Управление количеством эмблем изгнания.

source: Boots of Speed
ru: Сапоги-скороходы

source: Control the amount of Boots of Speed.
ru: Boots of Speed. Управление количеством сапогов-скороходов.

source: Chaos Device
ru: Устройство Хаоса
