Repository: obsidian-level-maker/Obsidian
Catalog: language/*.po
Languages: ru

source: Mons
ru: Монстры

source: Game Settings
ru: Настройки игры

source: Game:
ru: Игра:

source: Engine:
ru: Движок:

source: Length:
ru: Длина:

source: Theme:
ru: Тема:

source: Build
ru: Старт

source: Quit
ru: Выход

source: Game
ru: Игра

source: The following games will have gameplay that differs from the original IWADs: Hexen: Game progression is linear and episodic. There are no hubs present. The Death Wyvern is not present in the monster table due to the infeasibility of scripting and flight pathing. Strife: Quests/multiple endings not yet implemented. Progression is linear and game will end on last level generated.
ru: Следующие игры имеют изменения в геймплее относительно оригинальных IWAD: Hexen: игра будет линейной и эпизодической, без хаб-уровней. Из-за практически невозможной сложности автоматического написания сценариев и маршрутов полёта Виверн Смерти (Death Wyvern) не будет присутствовать ни на одном уровне. Stife: квесты и различающиеся концовки пока что не добавлены. Прогрессия линейна, и игра закончится на последнем сгенеррованном уровне.

source: Engine
ru: Движок

source: Available Engines: ZDoom Family: Engines that use ZDoom as a base. Example ports: GZDoom, LZDoom Vanilla DOOM: Doom with its original engine limits. Example ports: Doom within DOSBox, Chocolate Doom. NOTE: This option will use SLUMP as the map builder. Limit Removing: Any engine that raises the limits of the original game to prevent crashes, but is not Boom-compatible. Example ports: Doom2-plus, Doomsday 1.x, Crispy Doom Boom-Compatible: Engines that are able to use the entire suite of Boom types and features. Most modern source ports fall into this category at a minimum. PrBoom-Compatible: Boom-compatible, but also capable of using extended nodes. Example ports: DSDA-Doom, PrBoom+um EDGE-Classic: Boom-compatible, plus additional specials and other advanced features. Eternity: Boom-compatible, software renderer only, but with advanced features such as UDMF.
ru: Доступные игровые движки. Семейство ZDoom: (G-/L-/Q-)ZDoom, Zandronum, ZDaemon и другие, основанные на ZDoom. Оригинальный Doom: движок Doom как таковой, с учётом его ограничений. При выборе этой опции будет использоваться генератор карт SLUMP. Limit Removing: любой игровой движок, расширяющий лимиты оригинала для предотвращения вылетов. ВНИМАНИЕ: данный пункт использует довольно ограниченное количество префабов. Если Вы предполагаете проходить WAD на движке, поддерживающим формат Boom, лучше выбрать соответствующий пункт. Совместивый с BOOM: движки, совместимые с Boom, и позволяющие использовать все его возможности и расширения. Совместивый с PrBoom: то же, что выше, но также с расширенным использованием Map Nodes. Классический EDGE: совместимый с BOOM, но с добавлениением некоторых специфичных для EDGE возможностей. Eternity [экспериментальный]: для Software-рендерера, но с некоторыми улучшениями вроде UDMF.

source: Length
ru: Длина

source: Available WAD Lengths: Single Level: One map. A Few Maps: Four maps. One Episode: The length of an episode in the original IWAD. For Doom 2, which normally doesn't have episodes, this is 11 maps. Full Game: The length of a full game in the original IWAD.
ru: Доступная продолжительность сгенерированного сборника. Уровень: одна карта. Несколько уровней: четыре карты. Один эпизод: ориентироваться по длине эпизода выбранного IWAD. Если чётко выраженного деления нет (например, Doom 2), создаётся одиннадцать карт. Полная игра: по количеству уровней в выбранном IWAD.

source: Theme
ru: Тема

source: Available Themes: Original: Follows the theme progression of the original IWAD. Episodic: Each episode follows a single randomly chose theme. Bit Mixed: Theme will change every few levels. Jumbled Up: Level themes are purely random. Psychedelic: Trippy. Other themes listed are game-specific.
ru: Доступные темы: Как в оригинале: следовать изменению тем выбранного IWAD. По эпизодам: каждый эпизод имеет собственную одну тему. Если не указана соответствующая настройка, то тема выбирается случайно. Немного перемешать: темы будут меняться каждые несколько уровней. Сильно перемешать: для каждого уровня выбирается собственная тема. Психоделия: тема не выбирается. Полный хаос на соседних текстурах. Остальные темы специфичны для каждой отдельно взятой игры.

source: Enter Value:
ru: Введите значение:

source: Use Slider Value
ru: Использовать слайдер

source: File/Options
ru: Файл/Опции

source: File/Theme
ru: Файл/Тема

source: File/Set Seed
ru: Файл/Ключ генерации

source: File/Config Manager
ru: Файл/Конфигурация

source: Help/About
ru: Помощь/О программе

source: Help/View Logs
ru: Помощь/Просмотр лога

source: Help/Glossary
ru: Помощь/Глоссарий

source: Help/
ru: Помощь/

source: Help/Tutorial
ru: Помощь/Руководство

source: Surprise Me/Go
ru: Удивить/Перегенерировать выбранное

source: This glossary's main purpose is for translators to have a space to provide longer definitions for terms that may not have a direct equivalent to their English counterparts. If there is a need for an English version, this will be populated in the future.
ru: ══ От переводчиков ══ Часть слов, в основном укоренившиеся в широких кругах (с позволения сказать, имена собственные — имп, ревенант, ...) я просто транслитерировал, дословно переводя только в некоторых подсказках. Некоторые термины, хорошо звучащие в английском языке, при попытке локализации оказались слишком длинными для отведённого лимита символов. Поэтому некоторые слова пришлось заменить на более короткие варианты; к таким можно отнести слово "Префаб" — заготовка/составляющая уровня/примитив/кубик конструктора, происходящее от английского "Pre-fabricated" (дословно "Предсобранный"). В HaxC и Harmony никто из переводчиков не играл и в русскоязычном сегменте Интернета эти игры неизвестны, поэтому названия предметов и противников из них пока что не переведены; если Вы разбираетесь в этой теме и хотите помочь, есть прекрасная возможность дополнить файл русского языка. Примерно та же ситуация с Chex Quest, но для него хотя бы существует частичный перевод в GZDoom от Kostov (Undead).
