Repository: obsidian-level-maker/Obsidian
Catalog: language/*.po
Languages: ru

source: Theme Mix-in Type
ru: Смешение слабо выраженных тем

source: Override behavior of the -ish theme choices.
ru: Позволяет с указанной частотой смешивать слабо выраженные темы с другими.

source: This replaces the -ish theme choices. By selecting Mostly, this means your selected theme is occasionally littered by other themes while setting it to Less means the original selected theme is what's littered in instead. Default behavior is Normal.
ru: Периодически смешивает слабо выраженные темы с какими-либо другими. Пункт «Преимущественно» означает, что выбранная слабая тема будет иногда "замусорена" другими темами; «Меньше» — что вместо этого будет смешана исходная тема.

source: Prebuilt Levels
ru: Предсозданные карты

source: Enable or disable prebuilt maps. When disabled, are replaced with generated maps instead.
ru: Добавлять ли карты, сделанные заранее. Если опция отключена, будут использоваться сгенерированные уровни.

source: Prebuilt levels are useful when, for example, a boss encounter like the Icon of Sin is desired. This sort of level would be very difficult to generate procedurally, and thus a handmade map is used instead.
ru: Готовые уровни обычно полезны тогда, когда требуется встреча с боссом — к примеру, Иконой Греха. Подобный уровень довольно сложно сгенерировать процедурно, поэтому вместо них может использоваться одна из подходящих карт, сделанных вручную заранее.

source: Lighting Multiplier
ru: Множитель силы света

source: Adjust overall map lighting
ru: Подправить среднюю силу освещения карт.

source: This will apply a multiplier to the values in the default lighting tables when determining the brightness level of a room. If control over the minimum or maximum brightness values is desired, please use the Minimum/Maximum Brightness sliders in the Advanced Architecture module.
ru: Множитель применится к обычным значениям из таблиц освещения при определении уровня яркости комнаты. Если требуется управление минимальной и/или максимальной яркостью в целом, используйте слайдеры "Минимальная/Максимальная яркость" в модуле "Расширенные настройки геометрии".

source: Outdoors
ru: Пространство под небом

source: Control the amount of outdoor areas.
ru: Насколько много будет локаций на открытом воздухе (под текстурой "F_SKY1" или её заменителе).

source: Caves
ru: Пещеры

source: Control the amount of caves.
ru: Насколько часто будут генерироваться пещеры.

source: Liquids
ru: Жидкости

source: Control the amount of liquids.
ru: Насколько часто будут генерироваться различные жидкости.

source: Hallways
ru: Коридоры

source: Control the amount of hallways.
ru: Насколько часто будут генерироваться коридоры.

source: Teleports
ru: Телепорты

source: Control the amount of teleporters.
ru: Насколько часто будут генерироваться телепорты.

source: Steepness
ru: Крутизна рельефа

source: Control the height difference of stairs, lifts, and joiners throughout levels.
ru: Управление перепадами высот по всему уровню, в том числе на лестницах, в комнатах и на лифтах.

source: Bottomless Vistas
ru: Виды ниже линии горизонта

source: This feature allows for vistas that show more of the skybox below the horizon. This does not prevent skybox tiling.
ru: Позволяет использовать виды на пространства, захватывающие часть скайбокса ниже горизонта — "бездонные" виды. Функция не предотвращает тайлинг текстуры неба.

source: Enable - Bottomless vistas can always show. Pick this choice when using 3D Skyboxes. Sky-gen Smart - Bottomless vistas appear only on episodes with no mountain backdrop based on the Sky Generator. Disable - Old Oblige behavior - no bottomless vistas.
ru: Включено: бездонные виды могут быть сгенерированы в любом случае. Зачастую применимо вместе с использованием 3D-скайбоксов. В зависимости от неба: позволять генерировать подобные виды только если небо на уровне не имеет рельефа (например, гор или пещер). Отключено: не генерировать виды — использовать старое поведение Oblige.

source: ZDoom 3D Skybox
ru: 3D-скайбокс ZDoom

source: Choose if 3D Skyboxes are rendered into levels and their style.
ru: Генерировать ли 3D-скайбоксы. Если "да", то насколько часто или при каком условии они будут сменять друг друга.

source: This is highly recommended when Bottomless Vistas are enabled in combination with a ZDoom Family engine.
ru: Для лучшего опыта использования 3D-скайбоксов рекомендуется включить опцию "Виды ниже линии горизонта".

source: Teleports Only
ru: Только телепортация

source: Closets Only
ru: Только открытие дверей

source: 20% Closets - 80% Teleports
ru: 20% дверей на 80% телепортов

source: 40% Closets - 60% Teleports
ru: 40% дверей на 60% телепортов

source: 60% Closets - 40% Teleports
ru: 60% дверей на 40% телепортов

source: 80% Closets - 20% Teleports
ru: 80% дверей на 20% телепортов

source: Weaker
ru: Элементарно

source: Average
ru: Средне

source: Tricky
ru: Неприятно

source: Treacherous
ru: Сложно

source: Dangerous
ru: Опасно

source: Deadly
ru: Смертельно

source: Lethal
ru: Летально

source: CRAZY
ru: БЕЗУМИЕ

source: Yes - Full Strength
ru: Как и на остальном уровне

source: Yes - Weak
ru: Ослабленные

source: Tougher
ru: Свирепее

source: Fiercer
ru: Беспощаднее

source: CRAZIER
ru: БЕЗУМИЕ

source: Disabled
ru: Отключены

source: Minor Bosses Only
ru: Только минибоссы

source: Minor and Nasty Bosses Only
ru: Без самых мощных

source: All Bosses
ru: Все боссы

source: Combat
ru: Бой

source: Monster Quantity
ru: Кол-во монстров

source: Mix It Up,Progressive
ru: Случайно,Постепенно

source: 0:None,0.15:0.15 (Trivial),0.35:0.35 (Sporadic),0.7:0.7 (Meager),1.0:1.0 (Easy),1.3:1.3 (Modest),1.5:1.5 (Bearable),2.0:2.0 (Rough),2.5:2.5 (Strenuous),3.0:3.0 (Formidable),3.5:3.5 (Harsh),4.0:4.0 (Painful),4.5:4.5 (Ferocious),5.0:5.0 (Unforgiving),5.5:5.5 (Punishing),6.0:6.0 (Murderous),6.5:6.5 (Grueling),7.0:7.0 (Unrelenting),7.5:7.5 (Arduous),8.0:8.0 (Barbaric),8.5:8.5 (Savage),9.0:9.0 (Brutal),9.5:9.5 (Draconian),10.0:10.00 (Merciless)
ru: 0:Без монстров,0.15:0.15 (Исчезающе мало),0.35:0.35 (Считанные единицы),0.7:0.7 (Редко),1.0:1.0 (Нечасто),1.3:1.3 (Скромно),1.5:1.5 (Терпимо),2.0:2.0 (Жестоковато),2.5:2.5 (Напряжённо),3.0:3.0 (Грозная сила),3.5:3.5 (Сурово),4.0:4.0 (Довольно больно),4.5:4.5 (Свирепо),5.0:5.0 (Изнуряюще),5.5:5.5 (Преступление и наказание),6.0:6.0 (Непрощающе),6.5:6.5 (Противоестественно),7.0:7.0 (Варварски),7.5:7.5 (Безжалостно),8.0:8.0 (Дико),8.5:8.5 (Беспощадно),9.0:9.0 (Истязающе),9.5:9.5 (Убийственно),10.0:10.00 (Удачи!)

source: Changes the amount of monsters placed in a map. Scales with level size.
ru: Изменяет количество монстров на уровне. Автоматически подгоняется под его размер.

source: For reference: Obsidian's default for normal is 1.0. Mix It Up: Selects quantities specified between Upper and Lower Bound choices on a chosen by the user. Progressive: creates a curve of increasing monster population also based on the Fine Tune options below. It does not matter if your Upper/Lower Bound selections are reversed. Progressive will pick the min VS max quantities selected. None: No monsters. Why would you choose this option? Trivial: Very, very few monsters. Almost nothing to kill. Sporadic: Very few monsters. Not many things to kill. Meager: Fewer monsters. Not challenging for the average player. Easy: Obsidian default quantity. Not too bad for casual players. Modest: Slightly above default. Still pretty easy for most. Bearable: Above average opposition. Getting warmer! Rough: Slightly difficult. Equivalent to late 90s megawads. Strenuous: Baby steps into big boy difficulty. Lots to kill! Formidable/Harsh: 'Easy' level of difficult. Considerable opposition. Painful/Ferocious: Getting into slaughterwad territory. Difficult! Unforgiving/Punishing: Slaughterwad level difficulty. Skill needed. Murderous/Grueling: Extremely high monster count. Unrelenting/Arduous: An uphill battle. Expect to reload saves often! Barbaric/Savage: Up into the hardest slaughterwads out there. Brutal/Draconian: Legions of demons await you on this setting. Merciless: Hell will throw everything at you at this setting, you masochist.
ru: О связанных опциях "Количество монстров", "Верхний предел" и "Нижний предел". Варианты из выпадающего списка для "Количества монстров": Случайно: для каждого уровня выбирает новое значение между нижним и верхним пределами. Постепенно: сложность нарастает от нижнего предела до верхнего. Притом их порядок не имеет значения — если верхний предел окажется меньше нижнего, они поменяются местами.

source: If you have Mix It Up or Progressive selected, you can define the upper bound here. Otherwise, this option is simply ignored.
ru: Если в опции "Количество монстров" вы выбрали вариант "Случайно" или "Постепенно", то значение, указанное здесь, будет трактоваться как верхняя граница. В противном случае параметр просто игнорируется.

source: If you have Mix It Up or Progressive selected, you can define the lower bound here. Otherwise, this option is simply ignored.
ru: Если в опции "Количество монстров" вы выбрали вариант "Случайно" или "Постепенно", то значение, указанное здесь, будет трактоваться как нижняя граница. В противном случае параметр просто игнорируется.

source: Monster Strength
ru: Сила монстров

source: Affects level of selected monsters for a level's monster palette.
ru: Влияет на тип выбираемых для генерации монстров.

source: 0.55:0.55 (Weak),0.75:0.75 (Easier),1:1 (Average),1.3:1.3 (Harder),1.7:1.7 (Tough),2.5:2.5 (Fierce),12:12 (CRAZY)
ru: 0.55:0.55 (Хилая),0.75:0.75 (Простая),1:1 (Средняя),1.3:1.3 (Сложная),1.7:1.7 (Выматывающая),2.5:2.5 (Яростная),12:12 (ДИКАЯ)

source: Ramp Up
ru: Усиление монстров

source: 0.5:0.5 (Very Slow),0.75:0.75 (Slow),1:1 (Average),1.5:1.5 (Fast),2:2 (Very Fast),3:3 (Extra Fast)
ru: 0.5:0.5 (Малозаметное),0.75:0.75 (Медленное),1:1 (Среднее),1.5:1.5 (Быстрое),2:2 (Крайне быстрое),3:3 (Экспоненциальное)

source: Rate at which monster strength increases as you progress through levels.
ru: Скорость, с которой увеличивается общая сила монстров по мере прохождения игры.

source: Default Weapon Starts
ru: Учитывать пистол-старт

source: Ensure every map can be completed with only the default weapon (ignore weapons obtained from earlier maps)
ru: Убеждаться, что каждую карту можно пройти со стандартным оружием. Иными словами, при проверке не учитывать оружие, которое могло быть получено на предыдущих уровнях.

source: Quiet Start
ru: Тихий старт

source: Makes start rooms mostly safe - no enemies and all outlooking windows are removed. (windows are retained on Procedural Gotchas) Default Obsidian behavior is 'no'.
ru: Делает стартовые комнаты в большинстве своём безопасными, убирая из неё всех монстров и не позволяя создавать в ней окна. Однако на данный момент на босс-арены опция не действует, что значит, что там окна будут продолжать генерироваться.

source: Affects how many different monster types can appear in each room. Setting this to NONE will make each level use a single monster type
ru: Определяет, как много разных видов монстров может быть сгенерировано в каждой комнате. Если выбран вариант "НЕТ", все монстры на уровне будут одного вида.

source: Monster Variety Jumpstart
ru: Вариативность со старта

source: Affects how many monster variations initially appear at the very first map.
ru: Определяет, насколько широко будут использоваться разные виды монстров на самой первой карте.

source: Bosses
ru: Боссы

source: Affects likelihood and difficulty of boss encounters.
ru: Влияет на вероятность и сложность встреч с боссами.

source: Bosses As Regulars
ru: Боссы как обычные враги

source: Normally Archviles/Barons/Cyberdemons and other big monsters are excluded from normal monster pool and only can appear as guard for important objective e.g. key. With this option enabled they are allowed to(rarely) spawn as a regular monster. WARNING: This CAN make maps much more difficult than normal.
ru: Как правило, арч-вайлы, бароны, кибердемоны и другие сильные монстры не выступают в роли рядовых противников, появляясь лишь рядом со стратегически важными объектами — к примеру, перед выходом или недалеко от ключа. С данной опцией им будет позволено изредка генерироваться и в качестве обычных противников. Предупреждение: эта настройка может сделать карты гораздо, гораздо сложнее.

source: Traps
ru: Ловушки

source: Control the amount of traps.
ru: Управляет количеством ловушек.

source: Trap Style
ru: Стиль ловушек

source: This option selects between using only teleport or closet traps. DEFAULT means both are used.
ru: Эта опция позволяет выбрать соотношение использования телепорт-ловушек и открывающихся ловушек. По умолчанию используются оба вида.

source: Trap Monsters
ru: Кол-во монстров в ловушках

source: Changes the quantity of ambushing monsters from traps.
ru: Изменяет количество монстров, сидящих в засадах в ловушках.

source: Cages
ru: Клетки

source: Control the amount of cages.
ru: Управляет количеством клеток с монстрами.

source: Cage Monsters
ru: Кол-во монстров в клетках

source: Changes the quantity of monsters in cages.
ru: Управляет количеством монстров в клетках.

source: Monsters in Secrets
ru: Монстры в секретах

source: I'm in your secret rooms, placing some monsters. Note: default is none.
ru: Создавать ли монстров в секретных комнатах, и, если "да", то ослаблять ли их по сравнению с общей сложностью уровня.

source: Scarce
ru: Редко

source: Bit Less
ru: Чуть меньше среднего

source: Bit More
ru: Чуть больше среднего

source: Very Soon
ru: Появляется крайне скоро

source: Sooner
ru: Появляется скорее

source: Later
ru: Появляется позже

source: Very Late
ru: Появляется крайне поздно

source: Rich
ru: Очень богато

source: Resplendent
ru: Сравнимо с сокровищницами

source: Pickups
ru: Предметы

source: Health
ru: Предметы здоровья

source: Control the amount of health items.
ru: Управление общим количеством предметов здоровья.

source: Ammo
ru: Боеприпасы

source: Control the amount of ammunition.
ru: Управление общим количеством амуниции.

source: Weapons
ru: Оружие

source: Control the amount of weapons.
ru: Управление общим количеством оружия — насколько скоро оно будет появляться.

source: Items
ru: Другие предметы

source: Control the amount of armor and miscellaneous items.
ru: Управление общим количеством брони и прочих предметов.

source: Secrets
ru: Количество секретов

source: Control the amount of secrets.
ru: Управляет количеством секретных мест на карте.

source: Secrets Bonus
ru: Особая награда в секретах

source: Adds extra content to secret rooms. Larger rooms offer more content. Default is NONE.
ru: Добавление дополнительнго содержимого секретным комнатам, в крупных локациях — больше. По умолчанию отсутствует.

source: Map Build Options
ru: Опции создания карты

source: Build REJECT
ru: Генерировать REJECT

source: Choose to build a proper REJECT lump.
ru: Создавать ли полноценный lump REJECT.

source: If this option is not selected, a blank REJECT lump with the proper size will be inserted into the map instead. This is to prevent errors with some engines that are expecting a "full" REJECT lump to be present.
ru: Если опция отключена, то в карту будет включён пустой lump REJECT необходимого размера. Некоторые игровые движки требуют присутствия в карте "заполненного" REJECT.

source: Binary
ru: Двоичный

source: Map Format
ru: Формат карты

source: Choose between UDMF and binary map format. Be advised that UDMF format can result in very large WAD files due to the size of its TEXTMAP lumps.
ru: Выбор между двоичным (исходным) форматом карт и форматом UDMF. Имейте в виду, что использование UDMF может привести к невероятно крупным файлам *.WAD из-за размера lump TEXTMAP.

source: Build Nodes
ru: Генерировать NODES

source: Choose to either build nodes or allow the engine itself to do so upon loading the map.
ru: Поедсоздавать ли lump NODES с помощью OBSIDIAN.

source: ZDoom is capable of building its own nodes in either Binary or UDMF. Obsidian uses the same internal nodebuilder as ZDoom, so maps should be compatible either way.
ru: ZDoom может создавать свои собственные nodes и для бинарного формата, и для UDMF. Obsidian использует тот же nodebuilder, что и ZDoom.

source: Ranged Only
ru: Только дальнобойные

source: No Fly Zone
ru: Запрет на летающих

source: Oops! All Nazis!
ru: Оу! Все — нацисты!

source: SLUMP Architecture
ru: Архитектура SLUMP

source: Minimum number of rooms per level.
ru: Минимальное количество комнат на уровень.

source: Room Bigification Chance
ru: Шанс увеличить комнату

source: % chance that SLUMP will attempt to increase a room's size.
ru: Вероятность того, что SLUMP попытается увеличить размер комнаты.

source: Forkiness
ru: Разветвляемость

source: % chance that a room will attempt to fork as the level grows.
ru: Вероятность того, что новая комната попытается разветвиться (создать развилку) по мере генерации.

source: 0% should look like a bunch of murder hallways. Forking is not guaranteed to succeed, especially if the Room Bigification Chance is increased.
ru: 0% — линейный уровень, состоящий из последовательно соединённых друг с другом комнат. Гарантии, что локация сможет разветвиться, нет — особенно если шанс увеличения комнаты выше нуля.

source: Deathmatch Spawns
ru: Deathmatch-старты

source: Add Deathmatch starts to generated levels.
ru: Добавляет Deathmatch-старты к сгенерированным уровням.

source: Major Nukage Mode
ru: Повышенная кислотность

source: Watch your step!
ru: "Смотри куда идёшь!"

source: Will fill most rooms with damaging liquids.
ru: Заполнит большинство комнат жидкостями, наносящими урон.

source: Prevents monsters from spawning in the starting room.
ru: Запретить появление монстров в стартовой комнате, но не во всём поле зрения.

source: Monsters in other rooms may still have a line of sight to you, so be careful!
ru: Запретить появление монстров в начальной комнате. Будьте внимательны, эта опция не гарантирует, что монстры из других комнат не заметят Вас сразу после старта!

source: SLUMP Monsters
ru: Управление монстрами: SLUMP

source: Monster Variety
ru: Вариативность монстров

source: Control what types of monsters are available
ru: Выбирает, какие виды монстров смогут быть сгенерированными.

source: ZScript
ru: На ZScript

source: ACS-Decorate
ru: На ACS + Decorate

source: A Bit Mixed
ru: Немного смешать

source: Snow-ish
ru: Больше снежных локаций

source: Desert-ish
ru: Больше пустынных локаций

source: Always Snow
ru: Только снег

source: Always Desert
ru: Только пустыня

source: If enabled, adds textures and content from the Obsidian Epic Resource Pack, which also includes new exclusive prefabs.
ru: Если включено, добавляет текстуры, акторы и новые эксклюзивные префабы из Obsidian Epic Resource Pack.

source: Custom Liquids
ru: Новые виды жидкостей

source: Utilize custom liquid flats or not.
ru: Будут ли использоваться новые виды жидкостей на поверхностях.

source: Custom Trees
ru: Новые деревья

source: Adds custom flat-depedendent tree sprites into the game. Currently only replaces trees on specific grass flats and will be expanded in the future to accomnodate custom Textures and more. If you are playing a mod that already does its own trees, it may be better to leave this off.
ru: Добавляет в игру спрайты деревьев, зависящие от поверхности, на которой они стоят. В настоящее время заменяет только деревья на определенных участках травы, однако в будущем функционал обяательно будет расширен для добавления пользовательских текстур. Если Вы играете в модификацию, в которой уже есть собственные виды деревьев, то, возможно, данную опцию лучше не включать.

source: Environment Theme
ru: Тема окружения

source: Influences outdoor environments with different textures such as desert sand or icey snow.
ru: Влияет на окружающую среду — заменяет необходимые участки на песок или снег.

source: Merge Textures WAD
ru: Присоединять ресурс-WAD

source: Allows the trimming down of resulting WAD by not merging the custom texture WAD. This will require you to extract and load up the WAD manually in your preferred sourceport installation. This is the preferrable option for multiplayer situations and server owners and have each client obtain a copy of the texture pack instead.
ru: Отключение настройки позволяет уменьшить размер выходного файла с уровнями посредством исключения из него всех ресурсов, добавляемых этим модулем. Поэтому для корректного отображения на уровне Вам потребуется подключить файл с ресурсами вручную. Опция предпочтительна для мультиплеера с использованием клиент-серверной архитектуры.

source: Include Brightmaps
ru: Присоединять Brightmaps

source: Allows merging Obsidian Textures brightmaps into the WAD. Does not include brightmaps for base resources from any of the games.
ru: Позволяет включать в выходной файл карты яркости (brightmaps) текстур Obsidian. Не включает их из любых других игр.

source: No Hell Environment Themes
ru: Отключить для адских тем

source: Renders hell theme maps to never use snow or desert environment themes regardless of theme assignment.
ru: Карты с темой ада никогда не будут использовать снежные или пустынные области.

source: ZDoom: Ambient Sounds
ru: ZDoom: звуки окружения

source: Selects the starting thing ID for generating ambient sound actors. Use only if you are playing a mod using conflicting Editor Numbers. If you don't know what this is this setting is best left as-is.
ru: Выбирает стартовый Thing ID для создания акторов звуков окружения. Изменяйте этот параметр только в случае, если Вы используете модификацию, DoomEdNums в которой конфликтуют со стандартным значением.

source: Adds ambient sound things to fabs, room themes, and environments (WIP). Needs an accompanying sound pack containing corresponding sound files to be included with your Doom launcher.
ru: [Функция в разработке] Добавляет некоторые звуковые эффекты к префабам, темам комнат и окружению в целом. Для работы необходимо вручную подгружать соответствующий набор звуков.

source: Plenty
ru: Достаточно

source: ZDoom Marines
ru: Морпехи ZDoom

source: WARNING! ZDoom Marines are hostile by default unless their behavior is altered by another mod!
ru: ВНИМАНИЕ! По умолчанию ZDoom-морпехи настроены к игроку агрессивно. Их поведение можно сменить модификациями.

source: Control the appearance of hostile ZDoom Marines.
ru: Управление количеством враждебных морпехов ZDoom.

source: ZDoom Marines : Control
ru: Морпехи ZDoom, тонкая настройка

source: Fist Marine
ru: Кулачники

source: Control the amount of Fist-wielding ZDoom Marines.
ru: Управление количеством морпехов-мастеров рукопашного боя.

source: Berserk Marine
ru: Под Берсерком

source: Control the amount of Berserked ZDoom Marines.
ru: Управление количеством морпехов под действием бонуса Берсерка.

source: Chainsaw Marine
ru: С бензопилой

source: Control the amount of Chainsaw-wielding ZDoom Marines.
ru: Управление количеством морпехов, вооружённых бензопилой.

source: Pistol Marine
ru: С пистолетом

source: Control the amount of Pistol-wielding ZDoom Marines.
ru: Управление количеством морпехов, вооружённых пистолетом.

source: Shotgun Marine
ru: С дробовиком

source: Control the amount of Shotgun-wielding ZDoom Marines.
ru: Управление количеством морпехов, вооружённых дробовиком.

source: SSG Marine
ru: С двустволкой

source: Control the amount of Super Shotgun-wielding ZDoom Marines.
ru: Управление количеством морпехов, вооружённых двуствольным дробовиком.

source: Chaingun Marine
ru: Пулемётчики

source: Control the amount of Chaingun-wielding ZDoom Marines.
ru: Управление количеством морпехов, вооружённых пулеметом.

source: Rocket Marine
ru: Ракетомётчики

source: Control the amount of Rocket Launcher-wielding ZDoom Marines.
ru: Управление количеством морпехов, вооружённых ракетницей.

source: Plasma Marine
ru: Плазмомётчик
