Repository: obsidian-level-maker/Obsidian
Catalog: language/*.po
Languages: ru

source: Control the amount of Plasma Rifle-wielding ZDoom Marines.
ru: Управление количеством морпехов, вооружённых плазмаганом.

source: Railgun Marine
ru: С рельсотроном

source: Control the amount of Railgun-wielding ZDoom Marines.
ru: Управление количеством морпехов, вооружённых рельсотроном (рельсовой пушкой/рейлганом).

source: BFG Marine
ru: С BFG9000

source: Control the amount of BFG 9000-wielding ZDoom Marines.
ru: Управление количеством морпехов, вооружённых BFG9000.

source: Merge Doom 1 and 2
ru: Объединить Doom 1 и 2

source: Shuffles music in the MAPINFO lump. Oblige's vanilla music shuffler uses a BEX lump and is therefore ignored when the ZDoom Addons module is active. Warning: the 'Merge Doom 1 and 2' option is for music packs that contain both Doom 1 and 2 direct patch replacements. Do not use unless you have such a pack.
ru: Перемешивает музыку в MAPINFO. Оригинальный модуль Oblige использует lump BEX и потому игнорируется, когда активен ZDoom Addons. Пункт меню "Объединить из Doom 1 и 2" предназначен для сборников музыки, которые напрямую заменяют композиции и из Doom 1, и из Doom 2. Не используйте, если у вас нет такого сборника.

source: Episode Selection
ru: Выбор эпизодов

source: Creates a classic Doom/Ultimate Doom style episode selection.
ru: Позволяет выбрать эпизод в стиле классического Doom/Ultimate Doom.

source: Original
ru: Как в оригинале

source: Jumbled Up
ru: Сильно перемешать

source: Bit Mixed
ru: Немного перемешать

source: Single Level
ru: Уровень

source: A Few Maps
ru: Несколько уровней

source: One Episode
ru: Один эпизод

source: Full Game
ru: Полная игра

source: Attempts to mimic various architectural features seen in the Doom IWAD maps. Only Doom 2 is supported right now while Doom is in the works but not implemented yet. NOTE: This will override settings in other parts of the program such as Level Size, Room Size, etc!
ru: OBSIDIAN будет пытаться создавать уровни, подобные тем, что представлены в выбранном IWAD. ПРИМЕЧАНИЕ: Эта опция переопределит абсолютное большинство остальных настроек уровней, монстров и предметов.

source: Unable to create wad file: %s
ru: Невозможно создать WAD-файл: %s

source: ZDBSP Error!
ru: Ошибка ZDBSP!

source: Cancelled
ru: Отменено

source: Error (create file)
ru: Ошибка создания файла

source: Light
ru: Свет

source: Hull
ru: Каркас

source: OBSIDIAN will now restart and apply changes to addons.
ru: Для применения изменений в аддонах OBSIDIAN сейчас перезапустится.

source: OK
ru: ОК

source: Cancel
ru: Отмена

source: Close
ru: Закрыть

source: Preparing...
ru: Подготовка...

source: Success
ru: Успешно

source: No such config file: {}
ru: Нет такого файла конфигурации: {}

source: Surprise Me/Preserve Old Config
ru: Удивить/Сохранить старую конфигурацию

source: Surprise Me/Randomize Architecture
ru: Удивить/Случайная архитектура

source: Surprise Me/Randomize Combat
ru: Удивить/Случайный бой

source: Surprise Me/Randomize Pickups
ru: Удивить/Случайные предметы

source: Surprise Me/Randomize Other
ru: Удивить/Случайные иные настройки

source: Addons/No Addons Detected
ru: Аддоны/(Дополнений не найдено)

source: Addons/Restart and Apply Changes
ru: Аддоны/Принять и перезапустить

source: Addons/
ru: Аддоны/

source: Sorry, an internal error occurred: {}
ru: Внутренняя ошибка: {}

source: An exception occurred: {}
ru: Исключение: {}

source: About OBSIDIAN
ru: Об OBSIDIAN

source: OBSIDIAN - Error Message
ru: OBSIDIAN — сообщение об ошибке

source: Select output file
ru: Выберите выходной файл

source: Unable to create the file: %s
ru: Невозможно создать файл: %s

source: Enter New Seed Number or Phrase:
ru: Новый ключ генерации:

source: Save
ru: Сохранить

source: Copy
ru: Копировать

source: Pick file to save to
ru: Выберите файл для сохранения

source: Unable to save the file: %s
ru: Невозможно сохранить файл: %s

source: Please choose a filename ending in .txt
ru: Выберите окончание названи яфайла в *.txt

source: OBSIDIAN Log Viewer
ru: Файл журналирования OBSIDIAN

source: OBSIDIAN Glossary
ru: Глоссарий перевода OBSIDIAN

source: Script Error: %s
ru: Ошибка скрипта: %s

source: Script Error
ru: Ошибка скрипта

source: CURRENT SETTINGS
ru: ТЕКУЩИЕ НАСТРОЙКИ

source: Error writing to file.
ru: Ошибка записи в файл.

source: Select file to load
ru: Выберите файл для загрузки

source: Unable to load the file: %s
ru: Невозможно загрузить файл: %s

source: Cannot open: %s %s
ru: Невозможно открыть: %s %s

source: No config found in file.
ru: В файле конфигурации не найдено.

source: PASTED TEXT
ru: -= ВСТАВЛЕННЫЙ ТЕКСТ =-

source: Load WAD/TXT
ru: Из WAD/TXT

source: Use
ru: Применить

source: Note: This will replace all current settings!
ru: Прим.: перезапись текущих настроек.

source: Reset to Default
ru: Сбросить

source: Note: This will delete the current CONFIG.txt and restart Obsidian!
ru: Сброс: перезапуск OBSIDIAN с удалением текущего CONFIG.txt.

source: Clipboard Operations
ru: Операции с буфером обмена

source: Cut
ru: Вырезать

source: Paste
ru: Вставить

source: OBSIDIAN Config Manager
ru: Конфигурация OBSIDIAN

source: AUTO
ru: АВТО

source: Enter Custom Prefix Format:
ru: Введите формат префикса:

source: Custom prefix cannot be blank!
ru: Префикс пуст.

source: Custom Prefix
ru: Собственный префикс файла

source: Custom prefixes can use any of the special format strings listed below. Anything else is used as-is. %year or %Y: The current year. %month or %M: The current month. %day or %D: The current day. %hour or %h: The current hour. %minute or %m: The current minute. %second or %s: The current second. %version or %v: The current Obsidian version. %game or %g: Which game the WAD is for. %engine or %e: Which engine the WAD is for. %theme or %t: Which theme was selected from the game's choices. %count or %c: The number of levels in the generated WAD.
ru: Большинство символов для собственного формата переносятся без изменений. Но также могут быть использованы следующие автозаменяющиеся значения: %year или %Y: текущий год. %month или %M: текущий месяц. %day или %D: текущий день. %hour или %h: текущий час. %minute или %m: текущая минута. %second или %s: текущая секунда. %version или %v: используемая версия OBSIDIAN. %game или %g: целевая игра (Doom, Heretic, ...). %engine или %e: целевой игровой движок. %theme или %t: выбранная тема. %count или %c: количество уровней в сгенерированном WAD.

source: Language:
ru: Язык:

source: Compress Output:
ru: Тип сжатия:

source: OFF|ZIP|PK3
ru: Без сжатия|ZIP|PK3

source: Filename Prefix:
ru: Префикс файла:

source: Date and Time|Number of Levels|Game|Engine|Theme|Version|Custom|Nothing
ru: Дата и время|Количество уровней|Игра|Игровой движок|Тема|Версия OBSIDIAN|(Пользовательский)|(Отсутствует)

source: Set Custom Prefix...
ru: Ввести префикс...

source: Set Default Output Path
ru: Путь сохранения...

source: Random String Seeds
ru: Случайные слова для сида

source: Will randomly pull 1 to 3 words from Obsidian's random word list and use those as input for the map generation seed. Purely for cosmetic/entertainment value.
ru: При включённой настройке будет случайно выбирать несколько слов из встроенной базы данных, добавляя их к ключу генерации. Можно считать, что используется исключительно для развлечения.

source: Password Mode
ru: Режим "пароля"

source: Will produce a pseudo-random sequence of characters as input for the map generation seed. Random String Seeds must be enabled to use this option.
ru: Создаёт псевдослучайную последовательность символов и использует её в качестве ключа генерации. Для работы требуется включённая опция "Случайные слова для сида".

source: File prefix changes require a restart. OBSIDIAN will now restart.
ru: Требуется перезапуск OBSIDIAN после изменения префикса файла.

source: WARNING! This option will allow you to manually enter values in excess of the (usually) stable slider limits for Obsidian. Any bugs, crashes, or errors as a result of this will not be addressed by the developers. You must select Yes for this option to be applied.
ru: ВНИМАНИЕ! Эта опция позволит вам вручную вводить значения, выходящие за стабильные/выверенные пределы слайдеров. Поэтому любые ошибки, вылеты и иные подобные вещи, порождённые нерегламентированным использованием программы, не будут направлены разработчикам.

source: Yes, break Obsidian
ru: Да, сломать всё

source: Restoring slider limits requires a restart. Obsidian will now restart.
ru: Требуется перезапуск OBSIDIAN для восстановления пределов слайдеров.

source: Create Backups
ru: Создание резервных копий

source: Overwrite File Warning
ru: Предупреждение о перезаписи файла

source: Debugging Messages
ru: Сообщения отладки

source: Ignore Slider Limits
ru: Игнорировать ограничения слайдеров

source: Preserve Failed Builds
ru: Оставлять прерванные сборки

source: Zip Logs When Saving
ru: Лог ZIP-архиватора

source: Preserve/Timestamp Previous Logs
ru: Ставить временную метку логам

source: # of Logs Preserved
ru: К-во хранимых логов

source: Obsidian will now restart to apply language changes. Obsidian will be in your selected language after restarting.
ru: Для того, чтобы изменение языка вступило в силу, OBSIDIAN необходимо перезапуститься. OBSIDIAN will now restart to apply language changes.

source: Restart Lua VM Between Builds
ru: Перезапускать LUA VM

source: Obsidian has migrated from Lua to LuaJIT. One side effect of this is that even with a fixed seed, subsequent runs with the same configuration will not guarantee the same result. Restarting the Lua VM between builds will improve the odds of being able to repeat the results of a prior seed/setting combination, with the downside of visibly restarting the program every time a map is generated (even unsuccessfully). If you have no particular need to recreate the results of prior runs, this option can be safely left off.
ru: OBSIDIAN перешёл с Lua на LuaJIT. Одним из последствий этого является то, что результаты генерации без перезахода в программу, даже при одинаковом ключе генерации, будут различаться. Эта опция позволяет перезагружать виртуальную машину LUA перед каждой новой сборкой, что практически всегда позволит получать одинаковые результаты на одном ключе генерации. Если Вам не требуется получать идентичные результаты — к примеру, для отладочных целей — настройку можно спокойно оставлять нетронутой.

source: Note: some options require a restart.
ru: Примечание: некоторые параметры требуют перезапуска.

source: OBSIDIAN Misc Options
ru: Параметры OBSIDIAN

source: Select Theme file to load
ru: Выберите файл темы для загрузки

source: Windows scaling changes require a restart. OBSIDIAN will now restart.
ru: Для того, чтобы изменение масштаба окон вступило в силу, OBSIDIAN необходимо перезапуститься.

source: Plastic widget theme requires a restart. OBSIDIAN will now restart.
ru: Для того, чтобы изменение на пластиковую тему вступило в силу, OBSIDIAN необходимо перезапуститься.

source: Switching pane modes requires a restart. OBSIDIAN will now restart.
ru: Для того, чтобы изменение режима панели вступило в силу, OBSIDIAN необходимо перезапуститься.

source: Switching font selection requires a restart. OBSIDIAN will now restart.
ru: Для того, чтобы изменение шрифта вступило в силу, OBSIDIAN необходимо перезапуститься.

source: Select Panel Text Color
ru: Цвет основного шрифта

source: Select Button Text Color
ru: Цвет шрифта кнопок

source: Select Panel Color
ru: Цвет фона панелей

source: Select Highlight Color
ru: Цвет подсветки

source: Select Button Color
ru: Цвет кнопок

source: Select Gradient Color
ru: Цвет объектов с градиентом

source: Select Border Color
ru: Цвет границ

source: Select Gap Color
ru: Цвет пустых мест

source: Defaults loaded. OBSIDIAN will now restart.
ru: Восстановлена тема по умолчанию. OBSIDIAN сейчас перезапустится.

source: Theme loading requires a restart. OBSIDIAN will now restart.
ru: Для того, чтобы новая тема вступила в силу, OBSIDIAN необходимо перезапуститься.

source: Window Scaling:
ru: Масштаб окон:

source: AUTO|Tiny|Small|Medium|Large|Huge
ru: АВТО|Микро|Маленький|Средний|Большой|Огромный

source: Font Size:
ru: Размер шрифта:

source: Font:
ru: Шрифт:

source: Widget Theme:
ru: Стиль виджетов:

source: Default|Gleam|Win95|Plastic
ru: Стандарт|Светлый|Имитация Win'95|Пластик

source: Box Theme:
ru: Стиль групп:

source: Default|Shadow|Embossed|Engraved|Inverted|Raised
ru: Стандарт|Тень|Тиснёный|Гравированный|Перевёрнутый|Поднятый

source: Button Theme:
ru: Стиль кнопок:

source: Default|Raised|Engraved|Embossed|Flat
ru: Стандарт|Поднятый|Гравированный|Тиснёный|Плоский

source: Color Scheme:
ru: Цветовая схема:

source: Default|Custom
ru: Стандарт|Свой

source: Panel Font
ru: Шрифт

source: Button Font
ru: Шрифт кнопок

source: Panels
ru: Панели

source: Highlights
ru: Подсветка

source: Buttons
ru: Кнопки

source: Gradient
ru: Градиент

source: Borders
ru: Границы

source: Gaps
ru: Пустое место

source: Use System Fonts (disables bundled fonts)
ru: Использовать системный шрифт

source: Single Pane Mode
ru: Режим одной панели

source: Load Defaults
ru: Сбросить

source: Load Theme
ru: Загр. стиль

source: Save Theme
ru: Сохр. стиль

source: Note: Some options require a restart.
ru: Примечание: некоторые параметры требуют перезапуска.

source: OBSIDIAN Theme Options
ru: Настройка внешнего вида OBSIDIAN

source: OBSIDIAN Tutorial
ru: Руководство OBSIDIAN

source: <center>Welcome to OBSIDIAN Level Maker! This quick tutorial will teach you the basics of navigating the user interface.</center>
ru: <center>Добро пожаловать в генератор уровней OBSIDIAN! Это краткое руководство расскажет об основах интерфейса.</center>

source: Next
ru: Далее

source: Back
ru: Назад

source: Finish
ru: Закрыть

source: <center>Game Settings, in the upper left area of the program window, contains all you need to build your very first WAD. Select the Game you would like to build a WAD for, the Engine that it will be played on, the Length (number of maps) of the WAD, and the Theme that you would like it to have. Once you press 'Build', you will be prompted to choose a location and filename for your WAD. After that, your WAD will be generated and saved to the location that you specified. NOTE: If you select 'Vanilla Doom' for the engine, an alternate map generator will be used to create your WAD. Although this WAD will be compatible with all engines, it is much simpler in nature than the maps made by Obsidian's main generator.</center>
ru: <center>Общие настройки в левой-верхней части окна программы содержат всё, что нужно для быстрого создания файла уровней (*.WAD). Выберите игру, для которой вы хотите создать WAD, игровой движок, длину (количество карт) сборника, а также его общую тему. По нажатию на кнопку «Старт», появится диалоговое окно места сохранения Вашего WAD; кнопка «Сохранить» запустит генерацию. ПРИМЕЧАНИЕ. Альтернативный генератор карт будет использоваться, если в качестве движка Вы выберете «Ванильный Doom». Подобный WAD будет совместим абсолютно со всеми движками, однако структура уровней в нём будет намного проще по сравнению с картами, созданными основным генератором Obsidian.</center>

source: <center>At some point, you will want to have more control over the contents of the WADs that you generate. This is where modules come into play. Modules are groups of options that can be changed to fine-tune your experience. Most modules are optional, and will need to be enabled or disabled accordingly.</center>
ru: <center>В какой-то момент Вы, вероятно, пожелаете управлять всем содержимым создаваемых Вами уровней. В этом случае Вам понадобятся разделы (модули) тонкого контроля; параметры для точной настройки, используемые в них, сгруппированы по смыслу. Большинство разделов являются необязательными и могут быть отключены (свёрнуты), и в этом случае настройки из них не будут применяться к генерации.</center>

source: <center>Some modules do not have any additional options to configure, and only need to be enabled or disabled. To enable them, simply click the checkbox to the left of their name. To disable them, clear the same checkbox by clicking it again.</center>
ru: <center>Некоторые разделы не имеют дополнительных параметров для настройки, их можно лишь включить или отключить. Чтобы включить их, просто установите флажок слева от их имени. Чтобы отключить их, снимите этот же флажок, нажав на него еще раз.</center>

source: <center>Other modules will have options that you can adjust after you enable them. These modules will have a + symbol next to their name instead of a checkbox. To enable them, click the + symbol. The + will turn into a - and the module will expand to show its options. Once you have adjusted these options, you MUST LEAVE THE MODULE EXPANDED for them to take effect. To disable the module, click the - symbol. It will collapse and the - will turn back into a +</center>
ru: <center>Другие разделы имеют параметры. Они вместо флажка будут иметь символ "+" рядом с их именем (в стандартной теме). Чтобы включить их, щёлкните символ "+", и тогда ниже развернётся список доступных параметров, а сам символ превратится в "-". После настройки параметров НЕОБХОДИМО ОСТАВИТЬ РАЗДЕЛ РАЗВЁРНУТЫМ для того, чтобы они вступили в силу. Вновь отключить раздел можно повторным нажатием на символ "-".</center>

source: <center>Module options come in three different flavors: Checkboxes, drop-down menus, and sliders. Checkboxes and drop-down menus are fairly self-explanatory, but we will cover some of the more advanced slider functions.</center>
ru: <center>Параметры раздела представлены в виде флажков, выпадающих меню и ползунков/слайдеров. Флажки и раскрывающиеся меню говорят сами за себя, но на следующей странице мы рассмотрим некоторые из сложных функций ползунка.</center>

source: <center>Some sliders will have an inverted triangle icon in the top right corner. Clicking this will show a menu with various choices. With the exception of 'Use Slider Value', these will ignore the number that the slider is set to in favor of a different means of determining the related value.</center>
ru: <center>Некоторые слайдеры имеют значок перёвернутого треугольника в правом-верхнем углу. Нажав на него, Вы увидите меню с различными вариантами. Практически все из них, за исключением пункта «Использовать слайдер», будут игнорировать установленное число, используя иной способ определения связанного значения.</center>

source: <center>All sliders will have a pair of brackets in the top right corner. Clicking these will open a dialog box where you can enter a value manually instead of using the slider handle or arrow buttons.</center>
ru: <center>Все слайдеры имеют пару квадратных скобок в правом верхнем углу. При нажатии на них откроется диалоговое окно, в котором Вы можете ввести значение вручную.</center>

source: <center>At first, the amount of settings in Obsidian can seem daunting. To help with this, every option has several helper widgets. To reset any option to its default value, click the "rollback" icon in the upper right corner. For a brief explanation of an option, a tooltip can be shown by hovering your cursor over the option title. In addition, there is a question mark icon in the top right corner of each option that can be clicked to open a window with a more detailed explanation.</center>
ru: <center>Поначалу количество настроек в Obsidian может выглядеть пугающим. Однако у каждой опции есть несколько облегчающих восприятие и работу функций. Во-первых, всплывающая подсказка при наведении курсора мыши на заглавие параметра. Во-вторых, сброс любого параметра до значения по умолчанию по нажатию на стрелочку справа от опции. В-третих, также справа от каждой настройки есть значок вопросительного знака, по которому можно щёлкнуть, чтобы открыть окно с (зачастую) более подробным объяснением.</center>

source: <center>Addons are a way to enhance the Obsidian experience further by adding new content, modules, and options. They come in the form of *.pk3 files that must be placed in the /addons folder of your Obsidian install before starting the program. Once there, they can be viewed, enabled, or disabled by clicking the "Addons" menu located in the top bar of the program. Good sources for new addons are either<br /><A HREF='https://github.com/GTD-Carthage/Obsidian-Addons'>the public Obsidian-Addons repo</A> or the #addon-files channel of our Discord.</center>
ru: <center>Аддоны — это способ ещё больше улучшить возможности Obsidian путём добавления нового контента, разделов и параметров. Они поставляются в виде файлов *.pk3, для подключения которых необходимо перед запуском программы поместить их в папку "/addons" внутри установочной директории Obsidian. После этого их можно просматривать, включать или отключать, нажав на пункт «Дополнения», расположенное в верхнем горизонтальном меню программы. Хорошие источники новых дополнений — <A HREF='https://github.com/GTD-Carthage/Obsidian-Addons'>общедоступный репозиторий Obsidian-Addons</A>, а также канал #addon-files нашего Discord-сервера.</center>

source: <center>If, for whatever reason, you receive an error while building, you can view Obsidian's logs by pressing F6 or selecting Help->View Logs from the program menu. From here, you can view and save the log contents to a file of your choosing. In addition, there is a LOGS.txt file with the same information that is stored in the same folder as obsidian.exe (or ~/.config/obsidian on *nix). This file is overwritten each time you start the program, so be sure to save this information elsewhere or use the log preservation options from the File->Options menu if you need to refer to it later! These logs are extremely important when seeking help or filing bug reports!</center>
ru: <center>Если Вы получите сообщение об ошибке во время сборки, можно просмотреть журнал Obsidian, нажав F6 или выбрав "Помощь"->"Просмотр лога" в меню программы. Там же можно сохранить содержимое журнала в отдельный файл. Кроме того, в каталоге с исполняемым файлом Obsidian (или по пути "~/.config/obsidian" на *nix-системах) существует файл LOGS.txt с аналогичной информацией. Этот файл перезаписывается при каждом запуске программы, поэтому обязательно сохраните информацию об ошибке в другом месте или используйте параметры сохранения журнала из меню "Файл"->"Опции"! Журналирование чрезвычайно важно при поиске ошибок!</center>

source: <center>There are more options to explore within Obsidian, but this should be enough to get you started. The tutorial can be viewed again at any time by choosing Help->Tutorial from the program menu. If you need more help, please ask in our Discord (invite link <A HREF='https://discord.gg/dfqCt9v'>https://discord.gg/dfqCt9v</A>) or check our wiki at <A HREF='https://github.com/dashodanger/Obsidian/wiki'>https://github.com/dashodanger/Obsidian/wiki</A>. Good luck in the infinite Hells!</center>
ru: <center>Obsidian можно изучать гораздо дольше, но этой информации для начала должно быть более чем достаточно. Руководство можно снова просмотреть в любое время, выбрав пункт меню "Помощь"->"Руководство". Если нужна дополнительная помощь, Вы можете спросить в нашем Discord-сервере (ссылка-приглашение: <A HREF='https://discord.gg/dfqCt9v'>https://discord.gg/dfqCt9v</A>) или посетить Википедию Obsidian по адресу <A HREF='https://github.com/dashodanger/Obsidian/wiki'>https://github.com/dashodanger/Obsidian/wiki</A>. Удачи в бесконечных проявлениях Ада!</center>

source: Progress and minimap display. Minimap Legend: White - Regular rooms Brown - Caves Blue - Outdoors Green - Parks
ru: Ход генерации и область предпросмотра. Расшифровка цветов: Белый — обычные комнаты; Коричневый — пещеры; Синий — пространства под небом; Зелёный — парковые зоны.

source: Seed: -
ru: Сид: -

source: Seed:
ru: Сид:

source: Ready to go!
ru: Готов!

source: Plan
ru: Геометрия

source: Rooms
ru: Помещения
