Repository: obsidian-level-maker/Obsidian
Catalog: language/*.po
Languages: ru

source: Adds support for m8f's Hellscape Navigator by generating name markers in the map per room.
ru: Встроенная поддержка модификации "Hellscape Navigator" за авторством m8f с помощью генерации названий комнат.

source: Custom Actor Names
ru: Имя для каждого врага

source: Renames tags of monsters with generated names. Humans recieve human names, demons recieve exotic names. Best used with TargetSpy or other healthbar mods to see the name. Uses class inheritance and string comparisons to determine monster species (human or demon). Use compatibility options only when necessary, preferably use Universal option instead.
ru: Переопределение тэгов монстров со сгенерированными именами. Люди получают человеческие имена, демоны — экзотические. Лучше всего использовать с TargetSpy или иной модификацией, отображающей полоску здоровья оппонента. Использует как проверку наследования от определённых классов, так и построковое сравнение для определения того, кто является человеком, кто — демоном.

source: QC:DE Lootboxes
ru: Лутбоксы QC:DE

source: Adds Quake Champions: Doom Edition Lootboxes as nice item pickups.
ru: Добавляет лутбоксы "Quake Champions: Doom Edition" на уровни.

source: D4T Entities
ru: Объекты из D4T

source: Adds Death Foretold field drones into items table and gore nests as potential minor boss monsters.
ru: Добавляет полевых дронов Death Foretold в таблицу предметов, а также гнёзда крови в качестве потенциальных минибоссов.

source: Trailblazer Upgrades
ru: Улучшения из Trailblazer

source: Adds Trailblazer's upgrade blueprints as separate pickups that can be found in the map.
ru: Добавляет чертежи улучшений Trailblazer на карты в виде отдельных предметов.

source: Complex Doom Modifications
ru: Подгонка под Complex Doom

source: Modifies general gameplay settings to balance generated maps more for use with Complex Doom due to its difficulty spike.
ru: Изменяет общие настройки геймплея для балансировки сгенерированных карт под Complex Doom из-за его довольно резкого увеличения сложности.

source: Music Swapper
ru: Перемешать музыку

source: Performs swapping of built-in music tracks via Dehacked.
ru: Использовать lump DeHackEd для перемешивания музыки.

source: Some
ru: Немного

source: Less
ru: Мало

source: Few
ru: Совсем мало

source: Rare
ru: Изредка

source: Heaps
ru: Множество

source: Non-damaging
ru: Урон наносить не будут

source: I LOVE IT
ru: МАКСИМУМ

source: Advanced Level Control
ru: Расширенное управление картами

source: Alt-start Rooms
ru: Разбросать кооп. старты

source: For Co-operative games, sometimes have players start in different rooms
ru: Иногда создавать старты в разных комнатах для кооперативных игр.

source: Foreshadowing Exit
ru: Сквозная тема выхода

source: Gets exit room theme to follow the theme of the next level, if different.
ru: По возможности использовать тему выхода, совпадающую с темой старта следующего уровня (если они различаются)

source: Reduces the amount of complex architecture in a map based on its size. Default is on in binary map format, off in UDMF map format.
ru: Уменьшает количество сложной архитектуры на карте в зависимости от ее размера. По умолчанию включено в двоичном формате карты и отключено в UDMF.

source: Point Decor
ru: Точечные декорации

source: Decor prefabs are prefabs placed along the floors such as crates, pillars, and other decorative elements which aren't tied to walls. This directly modifies probabilities on a per-room basis, not the density for decor prefabs in any given room. Note: DEFAULT actually behaves like Mix-It-Up.
ru: Элементы декора — это простые элементы, расположенные вдоль пола: ящики, колонны, факелы и иные декорации, не привязанные к стенам. Это напрямую изменяет вероятность их появления в префабах — не для каждой конкретной комнаты. Примечание: значение по умолчанию в данной опции равносильно варианту "Случайно".

source: Wall Decor
ru: Декорации на стенах

source: Determines the odds for decorated wall junctions in a map versus plain ones.
ru: Определяет шанс появления украшенных стен по сравнению с обычными.

source: Group Walls
ru: Группировать стены

source: Determines the percentage at which grouped walls are applied to rooms.
ru: Определяет процент, по которому сгруппированные стены будут применены к разным комнатам.

source: Single Room Themes
ru: Одна тема на все комнаты

source: Determines the odds at which a level would use a universal, single room theme for all indoors (buildings). Default is 50%.
ru: Определяет вероятность того, что все внутренние помещения будут иметь одну и ту же тему (вне зависимости от расстояния между ними). По умолчанию — 50%.

source: Limited Wall Groups
ru: Лимит группировки стен

source: Determines the odds at which a level would use fewer wall group choices but at greater quantites for more consistent visuals. Default is 50%.
ru: Определяет вероятность того, что группы стен на уровне будут менее разнообразными, однако визуально более согласованными. По умолчанию — 50%.

source: Peered Starts/Exits
ru: Парный старт/выход

source: Attempt to use matched start and exit fabs for a level (if a matched set is possible).
ru: По возможности использовать одинаковые префабы для стартовой комнаты и комнаты выхода.

source: Steppy Caves
ru: Крутые пещеры

source: Disables or enables caves with height variations.
ru: Управляет вариативностью высот внутри пещер.

source: Crushers
ru: Прессы, давящие поверхности

source: Changes probabilities for fabs with crushing sectors. Default is on.
ru: Управление вероятностью появления префабов с прессами и иными давящими поверхностями.

source: Dexterity Fabs
ru: Префабы на ловкость

source: Changes probabilities for fabs featuring Chasm-ish navigation. Default is on.
ru: Управление вероятностью появления префабов на координацию игрока, к примеру, в стиле "The Chasm" (Doom 2 MAP24).

source: Gambling Fabs
ru: Префабы на жадность игрока

source: Changes probabilities for fabs that may lockout a player on items. Default is on.
ru: Управление вероятностью появления префабов на азарт. Некоторые бонусы могут быть заблокированы из-за неосторожных действий, или сам игрок может попасть в ловушку, позарившись на некий предмет. Впрочем, возможно, всё перечисленное можно будет взять позже...

source: Sight Ambush Cages
ru: Клетки с засадой

source: Changes probabilities for cages that unleash its monsters when player is in sight. Default is on.
ru: Управление вероятностью появления клеток, которые высвобождают монстров внутри, как только игрок появляется в поле зрения.

source: Mirror Mazes
ru: Зеркальные лабиринты

source: Changes probabilities for hell mirror maze closets and joiners.
ru: Изменяет вероятность появления адских зеркальных комнат и соединительных областей.

source: Dark Mazes
ru: Тёмные лабиринты

source: Changes probabilities for dark/eye maze joiners in hell theme.
ru: Изменяет вероятность появления тёмных участков лабиринта в адской теме.

source: Stair Ladders
ru: Лестничные пролёты

source: Changes probabilities for high-step ladders (stairs).
ru: Изменяет вероятность появления лестничных пролётов.

source: Jump/Crouch Fabs
ru: Префабы с прыжками/приседаниями

source: Enables or disables prefabs that require jumping or crouching to navigate.
ru: Включает или отключает префабы, для которых необходимо использовать прыжки и/или приседания.

source: Damaging Hallways
ru: Наносящие урон жидкости

source: Changes the liquids on hallways with damaging floors to either be damaging (default) or non-damaging.
ru: Настройка, отвечающая за то, будут ли наносить урон жидкости, разлитые на локациях. По умолчанию урон наносится.

source: Match Theme
ru: Соответствовать теме

source: Ensures that prefabs selected match their intended Theme.
ru: Настройка гарантирует, что намеченные префабы будут соответствовать выбранной теме.

source: Reduces the amount of complex architecture in a map based on its size. Default is on.
ru: Уменьшает количество сложной архитектуры на карте в зависимости от её размера.

source: Large
ru: Крупный

source: Regular
ru: Обычный

source: Small
ru: Небольшой

source: Tiny
ru: Мелкий

source: Final Map Only
ru: Только последняя карта

source: Last Level of Episode
ru: Последний уровень в каждом эпизоде

source: Two per Episode
ru: Два за эпизод

source: Three per Episode
ru: Три за эпизод

source: Four per Episode
ru: Четыре за эпизод

source: 5% Chance, Any Map After Map 4
ru: Любая карта после четвёртой с шансом в 5%

source: 10% Chance, Any Map After Map 4
ru: Любая карта после четвёртой с шансом в 10%

source: Everything
ru: Все

source: Procedural Gotchas
ru: Процедурные босс-арены

source: This module allows you to fine tune the Procedural Gotcha experience if you have Procedural Gotchas enabled. Does not affect prebuilts. It is recommended to pick higher scales on one of the two options, but not both at once for a balanced challenge.
ru: Эта группа настроек позволяет подстраивать поведение процедурных босс-уровней, если таковые включены. Не влияет на предсделанные карты. Не рекомендуется устанавливать высокие значения на слайдерах "Дополнительные монстры" и "Дополнительная сложность" одновременно, если Вам нужен сбалансированный бой.

source: Gotcha Frequency
ru: Частота босс-арен

source: Procedural Gotchas are two room maps, where the second is an immediate but immensely-sized exit room with gratitiously intensified monster strength. Essentially an arena - prepare for a tough, tough fight! Notes: 5% of levels may create at least 1 or 2 gotcha maps in a standard full game.
ru: Процедурные босс-арены — это карты, состоящие из двух комнат, где вторая является крайне крупной ареной с действительно усиленным монстром. Готовьтесь к изнуряющей битве! Примечание: 5% уровней означают, что за полную длину игры будут созданы одна или две таких карты.

source: Extra Quantity
ru: Доп. монстры

source: Extra Strength
ru: Доп. сложность

source: 0:NONE,2:2 (Stronger),4:4 (Harder),6:6 (Tougher),8:8 (CRAZIER),16:16 (NIGHTMARISH)
ru: 0:(НЕТ),2:2 (Сильнее),4:4 (Гораздо сильнее),6:6 (Выматывающе),8:8 (СУМАСШЕСТВИЕ),16:16 (ИСТЯЗАНИЕ)

source: Offset monster quantity from your default strength of choice plus the increasing level ramp.
ru: Увеличение количества монстров в дополнение (в сумму) к текущему прогрессу сложности по игре.

source: Map Size
ru: Размер карт

source: Size of the procedural gotcha. Start and arena room sizes are relative to map size as well.
ru: Размер процедурных босс-карт. Размеры стартовой локации и арены также соотносятся с этим параметром.

source: Easier
ru: Проще

source: Moderate
ru: Средне

source: Nightmare
ru: Страх и Ужас

source: Reduced by 50%
ru: Уменьшено на 50%

source: Reduced by 25%
ru: Уменьшено на 25%

source: Increased by 50%
ru: Увеличино на 50%

source: Increased by 100%
ru: Увеличино на 100%

source: Increased by 200%
ru: Увеличино на 200%

source: 50% less
ru: Меньше на 50%

source: 80% less
ru: Меньше на 80%

source: 100% less
ru: Меньше на 100%

source: Much Harder
ru: Много сложнее

source: Extremely slow
ru: Крайне медленно

source: Very slow
ru: Очень медленно

source: Slow
ru: Медленно

source: Fast
ru: Быстро

source: Faster
ru: Крайне быстро

source: Scatter around arena
ru: Разбросаны по арене

source: Close to player start
ru: Лежат близко к старту

source: Exit after 10 seconds
ru: Выход после десяти секунд

source: Spawn pickup that exits the level
ru: Создавать предмет для выхода с уровня

source: Hard Limit
ru: Жёсткое ограничение

source: Soft Limit
ru: Мягкое ограничение

source: No Limit
ru: Без ограничения

source: Regular Gotcha Options
ru: Настройки босс-карт

source: Force Big-Boss Fight
ru: Обязательная босс-битва

source: Attempts to guarantee a fight against a boss-type (nasty tier) monster in the procedural gotcha.
ru: Гарантировать бой против крайне сильного противника на процедурных босс-уровнях.

source: ZScript Generated Boss Options
ru: ZScript-боссы

source: Enable Procedural Bosses
ru: Включить процедурных боссов

source: Toggles Boss Monster generation with special traits for Gotchas.
ru: Включает или отключает генерацию боссов со своими особенностями для процедурных карт.

source: Arena Steepness
ru: Крутизна рельефа арены

source: Influences steepness settings for boss arenas. Boss arena steepness is capped to be less intrusive to boss movement.
ru: Влияет на общую крутину арен. Диапазон возможных значений уменьшен ради того, чтобы рельеф не мешал передвижению босса.

source: Boss Difficulty
ru: Сложность босса

source: Increases or reduces chances of boss being based off more powerful monster and getting more powerful traits.
ru: Увеличивает или уменьшает шанс того, что босс будет основан на базе сильного монстра, получив при этом особые способности.

source: Boss Health Modifier
ru: Здоровье босса

source: Makes boss health higher or lower than default, useful when playing with mods that have different average power level of weapons.
ru: Изменяет количество здоровья босса. Обычно применяется для более точной подстройки под модификации, которые имеют отличный от стандартного усреднённый урон оружия игрока.

source: Hitscan Bosses
ru: Шанс хитскан-боссов

source: Reduces chance of hitscan bosses spawning.
ru: Управление шансом появления босса, использующего хитскан-атаки.

source: Visible Health Bar
ru: Полоса здоровья босса

source: If enabled, an hp bar will appear on UI while boss is active.
ru: Если включено, на экране будет отображаться полоска здоровья босса.

source: Enable Boss Music
ru: Изменение музыки

source: If enabled, encountering a boss will start boss theme music. (For now you have to have your own music files with lumps named D_BOSSx where x is boss number)
ru: Если включено, будет менять музыку при встрече с боссом. ПРИМЕЧАНИЕ: пока что Вам необходимо подгружать собственный сборник музыки с названиями "D_BOSSx", где 'x' — номер босса.

source: Reinforcement Strength
ru: Сила подкреплений босса

source: Influences the strength of reinforcements summoned by bosses
ru: Влияет на силу подкреплений, вызванного боссами.

source: Reinforcement Rate
ru: Частота подкреплений босса

source: Influences the spawn rate of reinforcements summoned by bosses
ru: Влияет на скорость появления подкреплений, вызываемых боссами.

source: Respect zero prob
ru: Учитывать вероятность 0%

source: If enabled, monsters disabled in monster control module cant be chosen as a boss.
ru: Если включено, то монстры, исключённые в модуле настройки вероятностей появления определённых видов противника, не будут выбраны в качестве боссов.

source: Monster limit type
ru: Ограничение вида монстров

source: Influences how boss difficulty and megawad progression affects the monster type of boss. Hard Limit: Doesn't allow monster types outside of range to ever spawn. Soft Limit: Reduces the probability of spawning of monster types outside of range. No Limit: Difficulty doesn't have effect on monster type selection.
ru: Влияет на то, как прогресс мегавада и сложность босса влияют на его тип. Жёсткое ограничение: не позволяет появляться монстрам, которые пока что не должны были появляться в последовательности уровней. Мягкое ограничение: снижает вероятность появления таких монстров. Без ограждений: сложность не влияет на выбор типа монстра.

source: Weapon placement
ru: Расположение оружия

source: Influences weapon placement in boss arena.
ru: Влияет на то, как будет расположено оружие на арене с боссом.

source: Exit type
ru: Тип выхода после победы

source: Changes exit type after boss has been destroyed.
ru: Изменяет тип выхода после победы над боссом.

source: Ammo supplies mult
ru: Множитель патронов

source: Changes multiplier of ammunition items on the boss arena(This is also affected by boss health multiplier).
ru: Изменяет количество лежащих патронов на босс-аренах. Учтите, что на этот параметр также влияет опция "Здоровье босса".

source: Healing supplies mult
ru: Множ. предметов здоровья

source: Changes multiplier of healing items on the boss arena.
ru: Изменяет количество предметов здоровья на босс-аренах.

source: Vanilla Only
ru: Только из текущего IWAD

source: Include Epic Textures
ru: Добавить пафосные текстуры

source: Procedural Textures
ru: Добавить процедурные текстуры

source: Scope
ru: Область действия

source: Stealth Monsters
ru: Стелс-монстры

source: Default Quantity
ru: Обычное количество

source: Control the appearance of stealth monster variants (ZDoom Family and EDGE-Classic only).
ru: Управление общим количеством стелс-монстров (только для семейства портов ZDoom и EDGE-Classic).

source: Stealth Monsters : Control
ru: Стелс-монстры, тонкая настройка

source: Control the amount of Stealth Zombiemen.
ru: Zombieman. Управление количеством стелс-зомби-рядовых.

source: Control the amount of Stealth Shotgunners.
ru: Shotgun Guy. Управление количеством стелс-зомби-сержантов.

source: Control the amount of Stealth Imps.
ru: Imp. Управление количеством стелс-импов.

source: Control the amount of Stealth Pinkies.
ru: Demon. Управление количеством стелс-пинки/стелс-демонов.

source: Control the amount of Stealth Cacodemons.
ru: Cacodemon. Управление количеством стелс-какодемонов.

source: Control the amount of Stealth Barons of Hell.
ru: Baron of Hell. Управление количеством стелс-баронов Ада.

source: Control the amount of Stealth Chaingunners.
ru: Chaingunner. Управление количеством стелс-пулемётчиков.

source: Control the amount of Stealth Hell Knights.
ru: Hell Knight. Управление количеством стелс-рыцарей Ада.

source: Control the amount of Stealth Revenants.
ru: Revenant. Управление количеством стелс-ревенантов/стелс-мстителей.

source: Control the amount of Stealth Mancubi.
ru: Mancubus (Fatso). Управление количеством стелс-манкубусов.

source: Control the amount of Stealth Arachnotrons.
ru: Arachnotron. Управление количеством стелс-арахнотронов.

source: Control the amount of Stealth Arch-Viles.
ru: Arch-Vile. Управление количеством стелс-арч-вайлов.

source: NO CHANGE
ru: Не изменять

source: Egypt (TNT)
ru: Египет (TNT)

source: Psychedelic
ru: Психоделия

source: Minisodic
ru: Разбить на микроэпизоды (?)

source: [Exp] Doom 2 Theme Control
ru: [Эксп.] Управление темами Doom 2

source: Episode 1
ru: Эпизод 1

source: Override regular theme for Episode 1.
ru: Переопределить обычную тему первого эпизода.

source: Episode 2
ru: Эпизод 2

source: Override regular theme for Episode 2.
ru: Переопределить обычную тему второго эпизода.

source: Episode 3
ru: Эпизод 3

source: Override regular theme for Episode 3.
ru: Переопределить обычную тему третьего эпизода.

source: Secret Levels
ru: Секретные уровни

source: Override regular theme for Secret Levels.
ru: Переопределить обычную тему секретных уровней.

source: Warning: Mix-ins are for now completely overriden when picking a choice with change.
ru: Предупреждение: любые смешения на данный момент полностью переопределяются, если выбрана подмена темы.

source: Flesh
ru: Thy Flesh Consumed (эп. 4)

source: [Exp] Doom 1 Theme Control
ru: [Эксп.] Управление темами Doom 1

source: Episode 4
ru: Эпизод 4

source: Override regular theme for Episode 4.
ru: Переопределить обычную тему четвёртого эпизода.

source: Enable
ru: Включено

source: Sky-gen Smart
ru: В зависимости от неба

source: Disable
ru: Отключено

source: Mostly
ru: Преимущественно

source: Very Fast Curve
ru: Очень быстро (за ¼ от игры)

source: Fast Curve
ru: Быстро (за ⅓ от игры)

source: Linear
ru: Линейно (на половине)

source: Slow Curve
ru: Медленно (за ⅔ от игры)

source: Very Slow Curve
ru: Очень медленно (за ¾ от игры)

source: Smaller
ru: Меньше

source: Larger
ru: Больше

source: Architecture
ru: Архитектура

source: Level Size
ru: Размер уровней

source: Mix It Up,Episodic,Progressive
ru: Случайно,По эпизодам,Постепенно

source: 10:10 (Microscopic),16:16 (Miniature),22:22 (Tiny),30:30 (Small),36:36 (Average),42:42 (Large),48:48 (Huge),58:58 (Colossal),66:66 (Gargantuan),75:75 (Transcendent)
ru: 10:10 (Микроскопический),16:16 (Миниатюрный),22:22 (Маленький),30:30 (Небольшой),36:36 (Средний),42:42 (Крупный),48:48 (Обширный),58:58 (Огромный),66:66 (Колоссальный),75:75 (Трансцендентный)

source: Determines size of map (Width x Height) in grid squares.
ru: Определяет размер карты (длина и ширина) со стороной ячейки, равной стороне квадрата BLOCKMAP-сетки.

source: FOR 32-BIT USERS: To prevent memory usage issues, the following maximum map size limits will be enforced regardless of slider setting: Full Game: -Fixed size: 30 -Progressive: 48 -Episodic: 48 -Mix It Up: 42 Episode: -Fixed size: 58 All other combinations will honor the slider settings. If you are planning to play on any choices that involve maps at sizes of 50 and above, Autodetailing will be enabled by default. The stability of maps with sizes 60 and beyond is not predictable.
ru: ДЛЯ ПОЛЬЗОВАТЕЛЕЙ 32-БИТНЫХ СИСТЕМ: во избежание ошибок, связанных с использованием и выделением памяти, верхний предел карт будет жёстко ограничен следующими значениями: Для полной игры: ├ Фиксированный размер: 30; ├ Постепенно: 48; ├ По эпизодам: 48; └ Случайно: 42. Один эпизод: ├ Фиксированный размер: 58; └ Другие комбинации будут использовать значение слайдера. Если вы планируете играть на любых вариантах, включающих карты размером 50 и выше, опция "Автоподгонка количества деталей" будет включена по умолчанию. Стабильность карт размером 60 и выше непредсказуема.

source: Upper Bound
ru: Верхний предел

source: Fine tune upper limit when Level Size is set to Episodic, Progressive or Mixed.
ru: Тонкая подстройка максимального размера уровня, если он установлен в одно из значений "Случайно", "По эпизодам" или "Постепенно".

source: Lower Bound
ru: Нижний предел

source: Fine tune lower limit when Level Size is set to Episodic, Progressive or Mixed.
ru: Тонкая подстройка минимального размера уровня, если он установлен в одно из значений "Случайно", "По эпизодам" или "Постепенно".

source: Ramp Factor
ru: Скорость увеличения уровней

source: Determines how fast or slow larger level sizes are reached in Progressive/Episodic mode.
ru: Определяет вид кривой скорости увеличения: насколько скоро начинают генерироваться крупные уровни в режимах "Постепенно" и "По эпизодам".

source: Very Fast Curve: Reach half-size at 1/4th of the game. Fast Curve: Reach half-size at 1/3rds. Linear: Reach half-size at half the game. Slow Curve: Reach half-size at 2/3rds. Very Slow Curve: Reach half-size at 3/4ths. Obsidian default is Fast Curve.
ru: Очень быстро: размеры уровней достигают половины от своего верхнего предела за ¼ от игры, кривая примерно равна функции плавности "easeOutQuint"; Быстро: размеры уровней достигают половины от своего верхнего предела за ⅓ от игры, примерно равно "easeOutCubic"; Линейно: размеры уровней плавно увеличиваются, максимум достигается ровно в конце сгенерированного сборника; Медленно: размеры уровней достигают половины от своего верхнего предела за ⅔ от игры, примерно равно "easeInCubic"; Очень медленно: размеры уровней достигают половины от своего верхнего предела за ¾ от игры, примерно равно "easeInQuint". Все определения и анимации функций плавности можно найти в Интернете — к примеру, на посвящённом этому сайте https://easings.net/ru.

source: Level Size Bias
ru: Уклон в этот размер уровня

source: Alters probability skew when using Mix It Up for level sizes.
ru: Меняет уклон в более малый или более крупный размер уровней при использовании настройки "Размер уровней"→"Случайно".

source: DEFAULT is a normal curve where Average is the most common size while smaller or larger sizes become rarer. Combine with Level Upper and Lower Bounds for greater control.
ru: По умолчанию применяется распределение Гаусса-Лапласа, при котором среднее значение появляется чаще всего, а шанс появления крайних значений становится очень мал. Можно комбинировать с настройками "Верхний предел" и "Нижний предел" для достижения более точных результатов.
