Repository: obsidian-level-maker/Obsidian
Catalog: language/*.po
Languages: ru

source: Episodic
ru: По эпизодам

source: Progressive
ru: Постепенно

source: Mix It Up
ru: Случайно

source: Warning: The game that you have selected is in an experimental state. WADs may not build successfully and certain gameplay features may not be implemented yet! To ignore this warning and continue generation for these games, check the "Experimental Games" checkbox located in the Debug Control Module. This message will change should development scope expand.
ru: Внимание: выбранная Вами игра пока поддерживается в экспериментальном режиме. В префабах для неё и выходном сборнике уровней могут присутствовать критические ошибки, а некоторые функции игрового процесса, вероятнее всего, ещё даже не были реализованы. Чтобы проигнорировать предупреждение и продолжить генерацию для, установите флажок "Экспериментальные игры", расположенный в отладочных настройках. Это сообщение будет меняться по ходу разработки.

source: Warning: Limit-Removing uses a very basic set of prefabs, and should only be used if your source port isn't compatible with any other choice! Click the help link next to the Engine setting for an explanation of the other choices. To disable this warning, check the "Suppress NoLimit Warning" checkbox located in the Debug Control Module.
ru: Предупреждение: Limit-Removing использует базовый набор префабов. Его следует использовать только в том случае, если Ваш порт не совместим ни с каким другим пунктом меню. Чтобы узнать об альтернативах, можно нажать на знак справки рядом с настройкой "Движок". Чтобы отключить это предупреждение, установите флажок «Подавить предупреждение об отсутствии ограничений», расположенный в отладочных настройках.

source: BOOM Compat
ru: Совместимый с BOOM

source: PrBoom Compat
ru: Совместимый с PrBoom

source: Advanced
ru: Расширенный

source: EDGE-Classic
ru: EDGE (экспериментальный)

source: Eternity (Experimental)
ru: Eternity (экспериментальный)

source: Vanilla DOOM
ru: Ванильный Doom

source: ZDoom Family
ru: Семейство ZDoom-портов

source: Tech
ru: Техническая

source: Urban
ru: Городская

source: Hell
ru: Адская

source: Deimos
ru: Деймос

source: Thy Flesh
ru: По четвёртому эпизоду

source: Plutonia
ru: The Plutonia Experiment

source: Egypt
ru: Египетская

source: [Exp] Heretic Theme Control
ru: [Эксп.] Управление темами Heretic

source: City
ru: Эп. 1: Город проклятых

source: Maw
ru: Эп. 2: Утроба Ада

source: Dome
ru: Эп. 3: Купол Д'Спарила

source: Ossuary
ru: Эп. 4: Склеп

source: Demense
ru: Эп. 5: Безумие

source: Forest
ru: Лес

source: Ice Caves
ru: Ледяные гроты

source: Fire and Steel
ru: Пламя и сталь

source: Swamp
ru: Болото

source: Dungeon
ru: Темница

source: Duke Nukem 3D (Exp)
ru: Duke Nukem 3D (эксп.)

source: Nukem City
ru: Город

source: Castle
ru: Замковая

source: Strife (Exp)
ru: Strife (экспериментальный)

source: Town
ru: Город

source: Chex Quest 3 Monster Control
ru: Настройка монстров Chex Quest 3

source: Commonus
ru: Флемоид

source: Control the amount of Commoni.
ru: Commonus (Flemoid). Управление количеством флемоидов.

source: 0:0 (None at all),.02:0.02 (Scarce),.14:0.14 (Less),.5:0.5 (Plenty),1.2:1.2 (More),3:3 (Heaps),20:20 (INSANE)
ru: 0:0 (Отсутствуют),.02:0.02 (Редко),.14:0.14 (Меньше),.5:0.5 (Средне),1.2:1.2 (Больше),3:3 (Много),20:20 (БЕЗУМИЕ)

source: Bipedicus
ru: Двуножка

source: Control the amount of Bipedici.
ru: Bipedicus. Управление количеством двуножек.

source: Armored Bipedicus
ru: Бронированная двуножка

source: Control the amount of Armored Bipedici.
ru: Armored Bipedicus. Управление количеством бронированных двуножек.

source: Quadrumpus
ru: Квадрумпус

source: Control the amount of Quadrumpi.
ru: Quadrumpus. Управление количеством квадрумпусов.

source: Cycloptis
ru: Циклоптис

source: Control the amount of Cyclopti.
ru: Cycloptis. Управление количеством циклоптисов.

source: Larva
ru: Личинка

source: Control the amount of Larvae.
ru: Larva. Управление количеством флем-личинок.

source: Flem Mine
ru: Флем-мина

source: Control the amount of Flem Mines.
ru: Flem Mine. Управление количеством флем-мин.

source: Stridicus
ru: Ложномерка

source: Control the amount of Stridici.
ru: Stridicus. Управление количеством ложномерок.

source: Super Cycloptis
ru: Сверхциклоптис

source: Control the amount of Super Cyclopti.
ru: Ultricus (Super) Cycloptis. Управление количеством сверхциклоптисов.

source: Vanilla
ru: Оригинал

source: NONE
ru: НЕТ

source: Chex Quest 3 Weapon Control
ru: Настройка оружия Chex Quest 3

source: Super Bootspork
ru: Супер-ложковилка

source: Control the likelihood of finding the Super Bootspork.
ru: Super Bootspork. Управление количеством супер-ложковилок.

source: Large Zorcher
ru: Большой Зорчер

source: Control the amount of Large Zorchers.
ru: Large Zorcher. Управление количеством больших Зорчеров.

source: Rapid Zorcher
ru: Скоростной Зорчер

source: Control the amount of Rapid Zorchers.
ru: Rapid Zorcher. Управление количеством скоростных Зорчеров.

source: Zorch Propulsor
ru: Зорч-ускоритель

source: Control the amount of Zorch Propulsors.
ru: Zorch Propulsor. Управление количеством Зорч-ускорителей.

source: Phasing Zorcher
ru: Фазерный Зорчер

source: Control the amount of Phasing Zorchers.
ru: Phasing Zorcher. Управление количеством фазерных Зорчеров.

source: LAZ Device
ru: Устройство «ЗБР»

source: Control the amount of LAZ Devices.
ru: LAZ Device. Управление количеством Устройств «ЗБР».

source: Weapon Preferences
ru: Настройка оружия

source: Alters selection of weapons that are prefered to show up depending on enemy palette for a chosen map. Normal: Monsters have weapon preferences. Stronger weapons and ammo are more likely to appear directly with stronger enemies. Vanilla: Vanilla Oblige-style preferences. Increases Zorch Propulsors if the map has more Flem Mines. NONE: No preferences at all. For those who like to live life dangerously with Super Cyclopti and only Super Bootsporks.
ru: Изменяет логику размещения оружия в зависимости от типов монстров на карте. Нормально: обычный учёт. Более сильные виды вооружения имеют повышенный шанс появиться перед сильными противниками. Как в оригинале: режим, наследованный от Oblige. Увеличивает шанс появления Зорч-ускорителей, если на уровне присутствует много флем-мин. НЕТ: Логика размещения отсутствует. Для тех, кто, к примеру, предпочитает иметь возможность противопоставить сверхциклоптисам только ложковилку.

source: Doom Monster Control
ru: Настройка монстров Doom

source: Zombieman
ru: Зомби-рядовой

source: Control the amount of Zombiemen.
ru: Zombieman. Управление количеством зомби-рядовых.

source: Shotgun Guy
ru: Зомби-сержант

source: Control the amount of Shotgunners.
ru: Shotgun Guy. Управление количеством зомби-сержантов.

source: Chaingunner
ru: Пулемётчик

source: Control the amount of Chaingunners.
ru: Chaingunner. Управление количеством пулемётчиков.

source: SS Nazi
ru: Нацисты

source: Control the amount of SS troops.
ru: SS Nazi. Управление количеством нацистов Wolfenstein SS.

source: Imp
ru: Имп

source: Control the amount of Imps.
ru: Imp. Управление количеством импов (бесов).

source: Lost Soul
ru: Потерянная душа

source: Control the amount of Lost Souls.
ru: Lost Soul. Управление количеством потерянных душ.

source: Demon
ru: Демон/пинки

source: Control the amount of Pinkies.
ru: Demon. Управление количеством пинки-демонов.

source: Spectre
ru: Спектр

source: Control the amount of Spectres.
ru: Spectre. Управление количеством спектров.

source: Pain Elemental
ru: Элементаль боли

source: Control the amount of Pain Elementals.
ru: Pain Elemental. Управление количеством элементалей боли.

source: Cacodemon
ru: Какодемон

source: Control the amount of Cacodemons.
ru: Cacodemon. Управление количеством какодемонов.

source: Hell Knight
ru: Рыцарь Ада

source: Control the amount of Hell Knights.
ru: Hell Knight. Управление количеством рыцарей Ада.

source: Revenant
ru: Ревенант

source: Control the amount of Revenants.
ru: Revenant. Управление количеством ревенантов (мстителей).

source: Mancubus
ru: Манкубус

source: Control the amount of Mancubi.
ru: Mancubus (Fatso). Управление количеством манкубусов.

source: Arachnotron
ru: Арахнотрон

source: Control the amount of Arachnotrons.
ru: Arachnotron. Управление количеством арахнотронов.

source: Arch-Vile
ru: Арч-вайл

source: Control the amount of Arch-Viles.
ru: Arch-Vile. Управление количеством арч-вайлов.

source: Baron of Hell
ru: Барон Ада

source: Control the amount of Barons of Hell.
ru: Baron of Hell. Управление количеством баронов Ада.

source: Cyberdemon
ru: Кибердемон

source: Control the amount of Cyberdemons.
ru: Cyberdemon. Управление количеством кибердемонов.

source: Spiderdemon
ru: Спайдердемон

source: Control the amount of Spider Masterminds.
ru: Spiderdemon (Spider Mastermind). Управление количеством пауков-предводителей.

source: Normal
ru: Нормально

source: Doom Weapon Control
ru: Настройка оружия Doom

source: Chainsaw
ru: Бензопила

source: Control the likelihood of finding a Chainsaw.
ru: Chainsaw. Управление количеством бензопил.

source: 0:0 (None),.02:0.02 (Scarce),.14:0.14 (Less),.5:0.5 (Plenty),1.2:1.2 (More),3:3 (Heaps),10:10 (I LOVE IT)
ru: 0:0 (Нет),.02:0.02 (Редко),.14:0.14 (Меньше),.5:0.5 (Средне),1.2:1.2 (Больше),3:3 (Много),10:10 (ЛЮБИМЫЙ ВИД)

source: Shotgun
ru: Дробовик

source: Control the amount of Shotguns.
ru: Shotgun. Управление количеством дробовиков.

source: Super Shotgun
ru: Двустволка

source: Control the amount of Super Shotguns.
ru: Super Shotgun. Управление количеством двустволок.

source: Chaingun
ru: Пулемёт

source: Control the amount of Chainguns.
ru: Chaingun. Управление количеством пулемётов.

source: Rocket Launcher
ru: Ракетница

source: Control the amount of Rocket Launchers.
ru: Rocket Launcher. Управление количеством ракетных пусковых устройств.

source: Plasma Rifle
ru: Плазмаган

source: Control the amount of Plasma Rifles.
ru: Plasma Rifle. Управление количеством плазменных винтовок.

source: Control the amount of BFG 9000s.
ru: BFG 9000. Управление количеством BFG 9000.

source: Alters selection of weapons that are prefered to show up depending on enemy palette for a chosen map. Normal: Monsters have weapon preferences. Stronger weapons and ammo are more likely to appear directly with stronger enemies. Vanilla: Vanilla Oblige-style preferences. Reduces rocket launchers if the map has more pain elementals, lost souls, demons/specters while increases BFG's for cyberdemons and spider masterminds. No other weapon preferences. NONE: No preferences at all. For those who like to live life dangerously with lost souls and only rockets.
ru: Изменяет логику размещения оружия в зависимости от типов монстров на карте. Нормально: обычный учёт. Более сильные виды вооружения имеют повышенный шанс появиться перед сильными противниками. Как в оригинале: режим, наследованный от Oblige. Прямая зависимость количества BFG9000 и энергоячеек к ним от количества кибердемонов и спайдердемонов, обратная зависимость количества ракет от частоты элементалей боли на уровне. НЕТ: Логика размещения отсутствует. Для тех, кто, к примеру, предпочитает иметь возможность противопоставить потерянным душам только ракетницу.

source: Doom Item Control
ru: Настройка предметов Doom

source: Health Bonus
ru: Бонусы здоровья

source: Control the amount of Health Potions.
ru: Health Bonus. Управление количеством бонусов здоровья.

source: Stimpack
ru: Малые аптечки

source: Control the amount of Stimpacks.
ru: Stimpack. Управление количеством малых аптечек.

source: Medikit
ru: Аптечки

source: Control the amount of Medikits.
ru: Medikit. Управление количеством аптечек.

source: Armor Bonus
ru: Бонусы брони

source: Control the amount of Helmets.
ru: Armor Bonus. Управление количеством бонусов брони.

source: Green Armor
ru: Зелёная броня

source: Control the amount of Green Armor.
ru: Green Armor. Управление количеством белёной брони.

source: Blue Armor
ru: Синяя броня

source: Control the amount of Blue Armor.
ru: Blue Armor (Megaarmor). Управление количеством синей брони.

source: Soulsphere
ru: Соулсфера

source: Control the amount of Soulspheres.
ru: Soulsphere. Управление количеством соулсфер.

source: Backpack
ru: Рюкзак

source: Control the amount of Backpacks.
ru: Backpack. Управление количеством рюкзаков.

source: Berserk Pack
ru: Берсерк

source: Control the amount of Berserk Packs.
ru: Berserk Pack. Управление количеством бонусов берсерка.

source: Invisibility
ru: Невидимость

source: Control the amount of Invisibility Spheres.
ru: Invisibility. Управление количеством бонусов невидимости.

source: Invulnerability
ru: Неуязвимость

source: Control the amount of Invulnerability Spheres.
ru: Invulnerability. Управление количеством бонусов неуязвимости.

source: Map Computer
ru: Автокарта

source: Control the amount of Map Computers.
ru: Map Computer. Управление количеством заргужаемых автокарт.

source: Light Goggles
ru: Очки ночного видения

source: Control the amount of Light Goggles.
ru: Light Goggles. Управление количеством очков ночного видения.

source: Megasphere
ru: Мегасфера

source: Control the amount of Megaspheres.
ru: Megasphere. Управление количеством мегасфер.

source: Clips
ru: Обоймы

source: Control the amount of Clips.
ru: Clips. Управление количеством обойм для пистолета и пулемёта.

source: Bullet Box
ru: Коробки патронов

source: Control the amount of Bullet Boxes.
ru: Bullet Box. Управление количеством коробок с патронами для пистолета и пулемёта.

source: Shells
ru: Дробь

source: Control the amount of Shells.
ru: Shells. Управление количеством патронов для дробовика.

source: Shell Box
ru: Коробки дроби

source: Control the amount of Shell Boxes.
ru: Shell Box. Управление количеством коробок патронов для дробовика.

source: Rocket
ru: Ракеты

source: Control the amount of Rockets.
ru: Rocket. Управление количеством ракет.

source: Rocket Box
ru: Коробки ракет

source: Control the amount of Rocket Boxes.
ru: Rocket Box. Управление количеством коробок ракет.

source: Cell
ru: Малые энергоячейки

source: Control the amount of Cells.
ru: Cell. Управление количеством малых энергоячеек.

source: Cell Pack
ru: Энергоячейки

source: Control the amount of Cell Packs.
ru: Cell Pack. Управление количеством больших энергоячеек.

source: Ignore
ru: Игнорировать

source: Warn
ru: Предупреждать

source: Abort
ru: Прерывать

source: Test Level Names
ru: Тест названий уровней

source: Test Title Names
ru: Тест заголовков

source: None
ru: Нет

source: Show All Steps
ru: Показывать все шаги

source: Show Successful Steps Only
ru: Показывать только успешные шаги

source: No
ru: Нет

source: Per Step (Very Slow)
ru: По шагам (крайне медленно)

source: Per Room (Slightly Slow)
ru: По комнатам (чуть медленнее)

source: No Live Minimap
ru: Только контуры (быстро)

source: Debug Control
ru: Отладочные настройки

source: Provides options for printing out more verbose log information. Advanced, highly experimental features can also be found here.
ru: Опции, связанные с отладкой, дополнительным журналированием и тому подобными вещами. Также здесь находятся некоторые экспериментальные и расширенные настройки.

source: Alternate Item Quantities
ru: Адаптивное кол-во предметов

source: Scales item distribution with map size (Experimental)
ru: Изменяет распределение предметов в зависимости от размера карты (экспериментальная функция)

source: Print Fab Materials
ru: Лог: материалы в префабах

source: Print list of textures/flats present in each fab
ru: Выводить в журнал список всех текстур в каждом префабе.

source: Print the names of all textures/flats preset in a prefab WAD. This will also list values like _FLOOR, _WALL, etc, prior to their conversion.
ru: Выводить названия всех текстур стен и поверхностей в WAD, содержащем примитив-составляющую. В список также будут включены такие наименования, как _FLOOR, _WALL и иные подобные ещё до их преобразования.

source: Missing Fab Material Behavior
ru: Поведение на пропущенных текстурах

source: Choose what to do when encountering a missing material
ru: Что делать, если в префабе оказалась отсутствующая текстура.

source: Provides the following options if a material definition isn't present in a game's MATERIALS table: Ignore: Silently continue; missing materials are usually replaced by an _ERROR or _DEFAULT texture. Warn: Continue, but write the name of the fab and the missing material to the logfile. Abort: Throw an error and halt generation, with an error message explaining which fab and material are causing the issue. Will also write this information to the logfile.
ru: Поведение при текстурах, использованных в префабе, но отсутствующих в таблице MATERIALS: Игнорировать: просто продолжать; пропущенные текстуры обычно заменяются на специальные значения "_ERROR" или "_DEFAULT". Предупреждать: продолжать, но написать названия префаба и пропущенной текстуры в файл лога. Прерывать: аварийно завершить генерацию с сообщением о префабе и текстуре, а также, как и в прошлом пункте, записать информацию в файл лога.

source: Check For Non-Vanilla Materials
ru: Сравнение материалов с ванильными

source: Choose what to do when encountering a non-vanilla material
ru: Что делать при нахождении в префабе материала, отличающегося от оригинальных.

source: If checked, will compare all flats/textures used against a list of vanilla materials for that IWAD, and treat non-vanilla materials as missing for the purposes of logging and throwing errors.
ru: Если включено, будет сравнивать все текстуры стен/поверхностей со списком материалов для текущего IWAD, считая материалы, отличные от оригинала, как пропущенные.

source: Whole Name Gen Names Only
ru: Предсозданные названия

source: Use only complete names from the Name Generator
ru: Использовать только полностью созданные названия из генератора имён.

source: Uses name generator names that are already complete phrases/sentences instead of trying to procedurally generate them.
ru: Использует генератор имён для порождения названий из уже законченных фраз или предложений, вместо того, чтобы создавать их процедурным способом.

source: Name Generator
ru: Генератор имён

source: Prints a demonstration sample of 32 names per category. Level Names = TECH, GOTHIC, URBAN, and BOSS level names Title Names = TITLE, SUB_TITLE, and EPISODE names
ru: Выводит демонстрационный пример 32 названий на каждую категорию. Названия уровней: TECH, GOTHIC, URBAN, BOSS; Названия заголовков: TITLE, SUB_TITLE, EPISODE.

source: Print ZDoom Strings
ru: Выводить строки ZDoom

source: Displays the story generator and custom quit message strings added by the ZDoom Special Addons: Story Generator.
ru: Сохраняет информацию генератора историй и новые сообщения выхода, добавляемые аддоном "ZDoom Special Addons: Story Generator".

source: Build Level
ru: Создать лишь эту карту

source: Allows the skipping of level construction along the WAD for debugging purposes.
ru: Позволяет оставить генерацию только одного выбранного номера уровня (для отладочных целей).

source: Shape Rule Stats
ru: Сохр. правила генерации форм

source: Displays usage statistics for shape grammar rules.
ru: Сохраняет статистику использования правил образования геометрических форм.

source: Save Map Previews
ru: Сохранить миниатюру

source: Saves SVG format images of generated map thumbnails.
ru: Сохраняет изображение сгенерированной карты в формате *.SVG

source: Save Minimap GIF
ru: Сохр. GIF предпросмотра

source: Save an animated GIF of the building process. Recommended in combination with the Live Growth Minimap.
ru: Сохраняет анимированный *.GIF процесса создания. Для использования с настройкой "Детальность предпросмотра".

source: Suppress NoLimit Warning
ru: Разрешить Limit-Removing

source: Suppress warning dialog when using Limit-Removing with the Doom family of games.
ru: Подавляет диалоговое окно предупреждения об использовании движка Limit-Removing для игр семейства Doom.

source: This warning only applies to the Doom series of games, as other supported games may only have Limit-Removing as a feasible choice.
ru: Предупреждение будет относиться только к серии игр Doom, так как в других предлагаемых играх даже наиболее старый формат уже поддерживал Limit-Removing.

source: Experimental Games
ru: Экспериментальные игры

source: Enables building of levels for experimental games.
ru: Позволяет создавать уровни для игр, с которыми пока не была проведена детальная отладка.

source: The following games are in an experimental status, meaning that they may have errors when building levels, or support for certain gameplay features has not been implemented yet: Strife
ru: Сейчас в списке: Strife

source: Custom Error Texture
ru: Собственная текстура ошибки

source: Replaces Obsidian's default texture with a high visibility version for easier detection of broken level geometry or missing textures.
ru: Изменяет стандартную текстуру OBSIDIAN на другую, куда более заметную, для упрощения определения поломанной геометрии уровня или пропущенных текстур.

source: Live Growth Minimap
ru: Детальность предпросмотра

source: Controls the granularity of steps shown on the GUI minimap as a level is built.
ru: Насколько подробным будет вывод в графическую область предпросмотра уровня (слева-снизу).

source: Higher levels of detail will increase the amount of time that it takes to generate a WAD. If saving an animated GIF of the build process, its animation speed will also be affected by this setting (less detail=slower, more detail=faster).
ru: Высокие уровни детализации будут увеличивать время, необходимое для генерации *.WAD. Также эта настройка влияет на скорость сохранения *.GIF-анимации, если таковая включена.

source: Attach DEBUG Info
ru: Встраивать DEBUG-информацию

source: Attaches certain debug info into an OBLOGS text lump in the generated WAD.
ru: Добавляет некоторую определённую информацию в lump "OBLOGS" в генерируемый WAD.

source: Export .MAP files
ru: Экспортировать *.MAP-файл

source: GZDoom: Fauna
ru: Фауна GZDoom

source: Flies
ru: Добавить мух

source: Adds flies to maps.
ru: Добавляет мух на карты.

source: Rats
ru: Добавить крыс

source: Adds scurrying rats to maps.
ru: Добавляет мечущихся крыс на карты.

source: Very Low Tech
ru: Почти нулевой

source: Low Tech
ru: Низкий

source: Mid Tech
ru: Средний

source: High Tech
ru: Высокий

source: BFG Fiesta
ru: BFG-вечеринка

source: Sight
ru: Игрок в зоне видимости

source: Range
ru: Игрок рядом

source: Close Range
ru: Игрок совсем близко

source: Map Start
ru: Со старта карты

source: More
ru: Больше

source: Lots
ru: Множество

source: Hordes
ru: Орды

source: Unmodified
ru: Без изменений

source: Harder
ru: Сложнее

source: Tough
ru: Гораздо сложнее

source: Fierce
ru: Феерия

source: Random
ru: Случайно

source: Regressive
ru: Регрессивно

source: Regressive Episodic
ru: Регрессивно по эпизодам

source: Yes + Merge
ru: Да, объединить

source: Yes + No Merge
ru: Да, не объединять

source: Green
ru: Зелёный

source: Grey
ru: Серый

source: Brown
ru: Коричневый

source: Dark Red
ru: Тёмно-красный

source: Blue
ru: Синий

source: Purple
ru: Фиолетовый

source: White
ru: Белый

source: Yellow
ru: Жёлтый

source: Orange
ru: Оранжевый

source: Dark Blue
ru: Тёмно-синий

source: Red
ru: Красный

source: Gold
ru: Золотой

source: Random OG Doom
ru: Случайный из Doom

source: Full Random
ru: Полностью случайный

source: Yes
ru: Да

source: No + Self Damage
ru: Нет, проходит урон по себе

source: [Exp]GZDoom Marine Closets
ru: [Эксп.] Комнаты ИИ-морпехов GZDoom

source: [WIP/Experimental]This module adds customizable closets to the map filled with friendly AI marines.
ru: [Экспериментальная функция] Этот модуль добавляет на карты настраиваемые помещения, заполненные дружественными морпехами под управлением ИИ.

source: Chance per map
ru: Шанс на карту
